[
  {
    "url": "https://genius.com/Arctic-monkeys--lyrics", 
    "id": 3952735, 
    "lyrics": "I saw you dancin'\nYou moved like Sinatra\nOn speed\n\nThe lights were a-flashin'\nAnd tongues were a-waggin'\nOver you\nIt's too late for tryin'\nIt's too late for denyin'\nAll those little things\nYou and me have done\nI'm sorry, hon'\nI was hopin' for a recall\nA mix of you high from the sun\nOh, but nothin'\nOnly lone magpies come\n\nI saw you dancin'\nYou moved like Sinatra\nOn speed", 
    "title": "-"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-2013-lyrics", 
    "id": 191899, 
    "lyrics": "Well, the times are slowly changing, baby, even when it's live\nYou can press pause and rewind\nYou knew it'd go amazing, but is this what you had in mind?\nOh, there's nothing you can't find\n\nIt's two thousand and thirteen, all across the galaxy\nIt's two thousand and thirteen\n\nOn the back of a transmitter, there's a little shiny fruit\nAnd it's coming after you\nAs for Instagram and Twitter, she got caught in both lassoes\nAnd neither one will cut her loose\n\nIt's two thousand and thirteen, all across the galaxy\nIt's two thousand and thirteen\n\nSo, baby, take a walk with me\nPast flying cars and time machines\nThere's magic like you won't believe\n\nIt's two thousand and thirteen, all across the galaxy\nIt's two thousand and thirteen", 
    "title": "2013"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-505-lyrics", 
    "id": 93916, 
    "lyrics": "I'm going back to 505\nIf it's a seven-hour flight or a forty-five-minute drive\nIn my imagination, you're waiting lying on your side\nWith your hands between your thighs\n\nStop and wait a sec\nWhen you look at me like that, my darling, what did you expect?\nI'd probably still adore you with your hands around my neck\nOr I did last time I checked\nNot shy of a spark\nA knife twists at the thought that I should fall short of the mark\nFrightened by the bite, though it's no harsher than the bark\nThe middle of adventure, such a perfect place to start\n\nI'm going back to 505\nIf it's a seven-hour flight or a forty-five-minute drive\nIn my imagination, you're waiting lying on your side\nWith your hands between your thighs\n\n\nBut I crumble completely when you cry\nIt seems like once again you've had to greet me with \"Goodbye\"\nI'm always just about to go and spoil a surprise\nTake my hands off of your eyes too soon\n\nI'm going back to 505\nIf it's a seven-hour flight or a forty-five-minute drive\nIn my imagination, you're waiting lying on your side\nWith your hands between your thighs and a smile", 
    "title": "505"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-7-lyrics", 
    "id": 149412, 
    "lyrics": "One, two, three, four, five, six, seven!\n\nWell, I wrote my number down\nI never wrote it down before\nWere gonna bring it over like something from a film\nBut I didn't have the bottle at all\nWell, I were looking and you kept staring\nYour thoughts pairing up with mine\nAnd when you're so pretty and I'm so shy\nYou probably did give me the eye, though, I'm sure you did\n\nWell, I went outside\nCouldn't say I tried and I felt regret\nBecause you haven't bashed me and dashed back in\n'Cause the ship hasn't sailed yet\nBut when I did I couldn't see your face\nI could see your mates but that wouldn't do\nWell, I dashed around, tried to find you\nBut you were nowhere to be seen, oh no, no\n\nLa-la-la, la-la-la, la, la-la-la-la\nLa-la-la, la-la-la, la, la-la-la-la\nLa-la-la, la-la-la, la, la-la-la-la\nLa-la-la, la-la-la, la, la-la-la-la\n\nWell, she moved in ways that kept her there\nIn our minds for days and weeks and months\nI was that amazed and there she stayed\nSurrounded by the \"What if?\"s and the \"Maybe\"s", 
    "title": "7"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-a-certain-romance-lyrics", 
    "id": 84281, 
    "lyrics": "\"Shall I keep rolling?\"\n\nWell, oh, they might wear classic Reeboks\nOr knackered Converse, or tracky bottoms tucked in socks\nBut all of that's what the point is not\nThe point's that there in't no romance around there\nAnd there's the truth that they can't see\nThey'd probably like to throw a punch at me\nAnd if you could only see 'em then you would agree\nAgree that there in't no romance around there\n\nYou know? Oh, it's a funny thing, you know\nWe'll tell 'em if you like, we'll tell 'em all tonight\nThey'll never listen, because their minds are made up\nAnd course it's all okay to carry on that way\n\n'Cause over there there's broken bones\nThere's only music so that there's new ringtones\nAnd it dun't take no Sherlock Holmes\nTo see it's a little different around here\nDon't get me wrong though, there's boys in bands\nAnd kids who like to scrap with pool cues in their hands\nAnd just 'cause he's had a couple of cans\nHe thinks it's all right to act like a dickhead\n\nDon't you know? Oh, it's a funny thing, you know\nWe'll tell 'em if you like, we'll tell 'em all tonight\nThey'll never listen, because their minds are made up\nAnd course it's all okay to carry on that way\n\nBut I said no, oh no\nWell, you won't get me to go\nNot anywhere, not anywhere\nNo, I won't go\nOh, no, no\n\n\nBut over there, there's friends of mine\nWhat can I say? I've known 'em for a long long time\nAnd they might overstep the line\nBut you just cannot get angry in the same way\nNo, not in the same way\nSaid, not in the same way\nOh no, oh no, no", 
    "title": "A Certain Romance"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-all-my-own-stunts-lyrics", 
    "id": 51729, 
    "lyrics": "Caricatures of your wrecking ball gown\nIn my mind all the time\nI wanna be in that damsel patterned alley\nWhere you go for a smoke\nAnd sorrow slow dances, the phones are lighting up\nTaking no chances, close but never close enough\n\nBeen watching cowboy films on gloomy afternoons\nTinting the solitude\nPut on your dancing shoes and show me what to do\nI know you've got the moves\n\nAll my own stunts, high noon has changed its tune\nLinking arms, sinking hearts\nAnd sorrow slow dances around the edges of her eyes\nTaking no chances, the last one out to win a prize\n\nBeen watching cowboy films on gloomy afternoons\nTinting the solitude\nPut on your dancing shoes and show me what to do\nI know you've got the moves\n\n\nI'm from High Green\nI'm from High Green", 
    "title": "All My Own Stunts"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-am-album-art-annotated", 
    "id": 479491, 
    "lyrics": "", 
    "title": "AM - Album Art"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-american-sports-lyrics", 
    "id": 3629325, 
    "lyrics": "So when you gaze at planet Earth from outer space\nDoes it wipe that stupid look off of your face?\nI saw this aura over the battleground states\nI lost the money, lost the keys\nBut I'm still handcuffed to the briefcase\n\nAnd I never thought, not in a million year\nThat I'd meet so many Lolas\nCan I please have my money back?\nMy virtual reality mask is stuck on ‘Parliament Brawl’\nEmergency battery pack, just in time for my weekly chat\nWith God on video call\n\nBreaking news, they take the truth and make it fluid\nThe trainer's explanation was accepted by the steward\nA montage of the latest ancient ruins\nSoundtracked by a chorus of \"You don't know what you're doing\"\n\nAnd I never thought, not in a million years\nThat I'd meet so many Lolas\n\nAnd all of my most muscular regrets\nExplode behind my eyes like American sports\n\nAnd I never thought, not in a million year\nThat I'd meet so many Lolas", 
    "title": "American Sports"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-anyways-lyrics", 
    "id": 4023232, 
    "lyrics": "          \n            Lyrics for this song have yet to be released. Please check back once the song has been released.\n          \n        ", 
    "title": "Anyways"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-arabella-lyrics", 
    "id": 212611, 
    "lyrics": "Arabella's got some interstellar-gator skin boots\nAn' a Helter Skelter 'round her little finger\nAn' I ride it endlessly\nShe's got a Barbarella silver swimsuit\nAn' when she needs to shelter from reality\nShe takes a dip in my daydreams\n\nMy days end best when the sunset gets itself behind\nThat little lady sittin' on the passenger side\nIt's much less picturesque without her catchin' the light\nThe horizon tries but it's just not as kind on the eyes\nAs Arabella, oh\nAs Arabella\n\nJust might’ve tapped into your mind and soul\nYou can't be sure\n\nArabella's got a '70s head\nBut she's a modern lover\nIt's an exploration, she's made of outer space\nAn' her lips are like the galaxy's edge\nAn' her kiss the colour of a constellation\nFallin' into place\n\nMy days end best when the sunset gets itself behind\nThat little lady sittin' on the passenger side\nIt's much less picturesque without her catchin' the light\nThe horizon tries but it's just not as kind on the eyes\nAs Arabella, oh\nAs Arabella\n\nJust might’ve tapped into your mind and soul\nYou can't be sure\n\n(That's magic) In a cheetah print coat\n(Just a slip) Underneath it, I hope\n(Asking if) I can have one of those\n(Organic) Cigarettes that she smokes\n(Wraps her lips) 'Round a Mexican Coke\n(Makes you wish) That you were the bottle\n(Takes a sip) Of your soul, an' it sounds like\n\n\nJust might’ve tapped into your mind and soul\nYou can't be sure", 
    "title": "Arabella"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-baby-im-yours-lyrics", 
    "id": 340074, 
    "lyrics": "Baby, I'm yours (Baby, I'm yours)\nAnd I'll be yours until the stars fall from the sky\nYours until the rivers all run dry\nIn other words, until I die\n\nBaby, I'm yours (Baby, I'm yours)\nAnd I'll be yours until the sun no longer shines\nYours until the poets run out of rhyme\nIn other words, until the end of time\n\nI'm gonna stay right here by your side\nAnd do my best to keep you satisfied\nNothing in the world could drive me away\nEvery day, you'll hear me say\n\nBaby, I'm yours (Baby, I'm yours)\nAnd I'll be yours until two and two is three\nYours until the mountains crumble to the sea\nIn other words, until eternity\n\nBaby, I'm yours, 'til the stars fall from the sky\nBaby, I'm yours, 'til the rivers all run dry\nBaby, I'm yours, until the sun no longer shines\nBaby, I'm yours, 'til the poets run out of rhyme\nBaby, I'm yours", 
    "title": "Baby I'm Yours"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-bad-woman-lyrics", 
    "id": 343989, 
    "lyrics": "When you left the house this evening\nYou said you'd be back in a little while\nBut I've been waiting for such a long time\nAnd this wait is driving me wild\n\nAnd while I wait, I think about you\nDo you need me and I'm not there?\nAre you planning to be without me?\nDo you have a new affair?\n\nYou're a bad, bad woman\nYou're a bad, bad woman\n\nPictures of you keep flashing through my mind\nIf you would only call, if you would be so kind\nImagine things, I see another man\nAnd it's this waiting I just can't stand\n\nYou're a bad, bad woman\nYou're a bad, bad woman\nYou're a bad, bad woman\nYou're a bad, bad woman", 
    "title": "Bad Woman"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-balaclava-lyrics", 
    "id": 93907, 
    "lyrics": "Running off over next door's garden before the hour is done\nIt's more a question of feeling than it is a question of fun\nThe confidence is the balaclava, I'm sure you'll baffle 'em good\nWill the ending reek of salty cheeks and runny makeup alone?\nOr will blood run down the face of a boy bewildered and scorned\nAnd you'll find yourself in a skirmish where you wish you'd never been born?\nYou tie yourself to the tracks and there isn't no going back\nAnd it's wrong, wrong, wrong, but we'll do it anyway 'cause we love a bit of trouble\n\nAre you pulling her from a burning building or throwing her to the sharks?\nCan only hope that the ending is as pleasurable as the start\nThe confidence is the balaclava, I'm sure you'll baffle 'em straight\nAnd it's wrong, wrong, wrong, but she can hardly wait\n\nThat's right, he won't let her out his sight\nNow the shaggers perform and the daggers are drawn\nWho's the crooks in this crime?\nThat's right, he won't let her out his sight\nNow the shaggers perform and the daggers are drawn\nWho's the crooks in this crime?\n\n\nThat's right, he won't let her out his sight\nThat's right, he won't let her out his sight\nThat's right, he won't let her out his sight\nWell, you'll be able to boast\nOf the day of the most flawless heist of all time\n\nYou knew that it'd be trouble right before the very first kiss\nQuiet and unassuming but you heard that they were the naughtiest\nShe pleaded with you to take it off but you resisted and fought\nBut sorry, sweetheart, I'd much rather keep on the balaclava", 
    "title": "Balaclava"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-batphone-lyrics", 
    "id": 3629332, 
    "lyrics": "I want an interesting synonym\nTo describe this thing\nThat you say we're all grandfathered in\nI'll use the search engine\n(We've got much to discuss)\nToo much to discuss over a bucket of balls\nI can recall the glow of your low beams\n\nIt's the big night in Tinsel City\nLife became a spectator sport\nI launch my fragrance called 'Integrity'\nI sell the fact that I can't be bought\nHave I told you all about the time that I got sucked into a hole\nThrough a handheld device?\nI will flashback now and again, but I'm usually alright\nThankfully, the process has been simplified\nSince the last time you tried\n\nI've recognised the glow of your low beams numerous times\nI'll be by the Batphone if you need to get a hold\nMaking a selection, opening credits roll\nPanoramic windows looking out across your soul\n\nYou go in through the door\nVengeance Trilogy wallpaper walls\nThey have re-decorated it all\nThey've changed all the lights and the bar's down the side\n\nI've recognised the glow of your low beams numerous times\nThrough fairly opaque blinds in the sitting room\nVehicles will pass by, but I know when it's you\nI'll be in a nose dive in my flying shoes\nRight behind your closed eyes like a memory from your youth\nI'll be by the Batphone if you need to get a hold\nMaking a selection, opening credits roll\nKiller Pink Flamingos, computer controlled\nPanoramic windows looking out across your soul", 
    "title": "Batphone"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-bigger-boys-and-stolen-sweethearts-lyrics", 
    "id": 125733, 
    "lyrics": "There's always somebody taller with more of a wit\nAnd he's equipped to enthral her and her friends think he’s fit\nAnd you just can't measure up though, you don't have a prayer\nWishing that you'd made the most of her when she was there\n\nThey've got engaged, there's no intention of a wedding\nHe's pinched your bird and he'd probably kick your head in\n\nBigger boys and stolen sweethearts\nOh, you’re better off without her anyway\nYou said you wasn't sad to see her go\nYeah, but I know you were though\n\nNow you don't know what she's up to, you can only assume\nIf she's not in the front of the shops then they've gone to his room\nBet she's gone 'round in her school stuff, bet that’s what he likes\nI know you thought she were different and you thought she were nice\n\nBut she's not nice, she's pretty fucking far from nice\nShe’s looking at you funny, rarely looking at you twice\n\nBigger boys and stolen sweethearts\nOh, you’re better off without her anyway\nYou said you wasn't sad to see her go\nYeah, but it's clear you were though\n\nHave you heard what she has been doing? Never did it for me\nHe picks her up at the school gate at twenty past three\nShe’s been with all of the boys but never went very far\nAnd she wagged English and Science just to go in his car\n\nThey've got engaged, there's no intention of a wedding\nHe's pinched me bird and he'd probably kick my head in\nOh, now the girls have grown\nYeah, but I'm sure that they still carry on in similar ways\n\nBigger boys and stolen sweethearts\nOh, I'm better off without her anyway\nI said I wasn’t sad to see her go\nYeah, but I’m only pretending, you know\nYeah, I’m only pretending, you know\nI was only pretending, you know\nI was only pretending, you know", 
    "title": "Bigger Boys and Stolen Sweethearts"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-bigger-boys-and-stolen-sweethearts-demo-lyrics", 
    "id": 3855609, 
    "lyrics": "There's always somebody taller\nWith more of a wit\nAnd he's equipped to enthrall her\nAnd her friends think he's fit\nAnd you just can't measure up no\nYou don't have a prayer\nWishing you had made the most of her\nWhen she was there\nThey've got engaged\nNo intention of a wedding\nHe's pinched your bird\nAnd he'd probably kick your head in\nBigger Boys and Stolen Sweethearts\nYou're better off without her anyway\nYou said you wasn't sad to see her go\nOh no\nHe might be one of those boys\nThat's all pretty and vain\nLikes to go in the sunbed\nAnd stays out of the rain\nSo that he don't get his hair wet\nYou wouldn't want that\nAt least he hasn't got a Nova\nOr a Burberry hat\nThey've got engaged\nNo intention of a wedding\nHe's pinched your bird\nAnd he'd probably kick your head in\nBigger Boys and Stolen Sweethearts\nYou're better off without her anyway\nYou said you wasn't sad to see her go\nOf course you were\nHave you heard what she's been doing?\nNever did it for me\nHe picks her up at the school gates\nAt twenty past three\nShe's been with all the boys\nBut never went very far\nShe wagged English and Science\nJust to go in his car\nThey've got engaged\nNo intention of a wedding\nHe's pinched my bird\nAnd he'd probably kick my head in, oh\nNow the girls have grown\nBut I'm sure they still carry on in similar ways\nBigger Boys and Stolen Sweethearts\nSo I'm better off without her anyway\nI said I wasn't sad to see her go\nBut I'm only pretending, you know\nYeah, I'm only pretending, you know\nYeah, I'm only pretending, you know\nOh I'm only pretending, you know", 
    "title": "Bigger Boys and Stolen Sweethearts (Demo)"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-black-treacle-lyrics", 
    "id": 51731, 
    "lyrics": "Lately I've been seeing things, belly button piercings\nIn the sky at night when we're side by side\nAnd I don't mean to rain on anybody's cabroilet\nOne of those games you're gonna lose\nBut you wanna play it, just in case\n\nNow it's getting dark and the sky looks sticky\nMore like black treacle than tar\nBlack treacle\nSomebody told the stars you're not coming out tonight\nAnd so they found a place to hide\n\nDoes it help you stay up late? Does it help you concentrate?\nDoes it tune you in when you chew your chin?\nAm I ruining your fun?\nAnd you talk the talk alright\nBut do you walk the walk or catch the train?\nYou wanted it, you got it, but you don't want it now\n\nNow it's getting dark and the sky looks sticky\nMore like black treacle than tar\nBlack treacle\nSomebody told the stars you're not coming out tonight\nAnd so they found a place to hide\n\nNow I'm out of place and I'm not getting any wiser\nI feel like the Sundance Kid behind a synthesiser\nAnd I tried last night to pack away your laugh\nLike a key under the mat\nBut it never seems to be there when you want it\n\nBlack treacle\nBlack treacle\nBlack treacle", 
    "title": "Black Treacle"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-brianstorm-lyrics", 
    "id": 63865, 
    "lyrics": "Brian, top marks for not trying\nSo kind of you to bless us with your effortlessness\nWe're grateful and so strangely comforted\nAnd I wonder, are you putting us under?\n'Cause we can't take our eyes\nOff the t-shirt and ties combination\nWell, see you later, innovator\n\nSome want to kiss, some want to kick you\nThere's not a net that you couldn't slip through\nOr at least that's the impression I get 'cause you're smooth and you're wet\nAnd she's not aware yet, but she's yours\nShe'll be saying, \"Use me, show me the jacuzzi\"\nI imagine that it's there on a plate, your whole rendezvous rate\nMeans that you'll never be frightened\nTo make 'em wait for a while\nI doubt it's your style\nNot to get what you set out to acquire\nThe eyes are on fire\nYou are the unforecasted storm\n\n(Brian) Calm, collected and commanding\n(Top marks for not trying) You leave the other story standing\nWith your renditions and jokes, bet there's hundreds of blokes\nThat have wept 'cause you've stolen their thunder\nAre you putting us under?\n'Cause we can't take our eyes\nOff the t-shirt and ties combination\nWell, see you later, innovator", 
    "title": "Brianstorm"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-brick-by-brick-lyrics", 
    "id": 51738, 
    "lyrics": "I wanna build you up\nBrick by brick\nI wanna break you down\nBrick by brick\nI’m gonna reconstruct\nBrick by brick\nI wanna feel your love\n\nBrick by brick, aaaaah\nBrick by brick, aaaaah\n\nI wanna steal your soul\nBrick by brick\nI wanna rock and roll\nBrick by brick\nI wanna rock and roll\nBrick by brick\nI wanna rock and roll\n\nBrick by brick, aaaaah\nBrick by brick, aaaaah\n\nI wanna brick by brick\nBrick by brick\nI wanna blow by blow\nBrick by brick\nI want an empty soul\nBrick by brick\nI wanna brick by brick by brick by...\n\nBrick by brick, aaaaah\nBrick by brick, aaaaah", 
    "title": "Brick by Brick"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-catapult-lyrics", 
    "id": 95943, 
    "lyrics": "Both sides\nIn softly came the growl from both sides\nAnd if his whisper splits the mist\nJust think of what he's capable of with his kiss\nNice try\nYou cannot turn away but nice try\nTurned your legs to little building blocks\nAnd with his index finger flicks you on your socks\n\nI go high-pitched\nHe'll talk and make your voice sound high-pitched\nDread to think if he got you on your own\nAnd whispered in your ear in that baritone\nIt's the same stone\nHis heart was cut out of the same stone\nThat they used to carve his jaw\nIt's impossible not to feel inferior\n\nAnd he could catapult you back to your daddy\nOr into any hissing misery\nAnd he will tell you how the day after a triumph\nFeels as hollow as the day after a tragedy\nHe'll extinguish any chance of escape\nWhen he slaps you on your arse or kisses your nape\nAnd he's leaving without saying bye\n\n\nAnd you will queue up to listen to him pissing\nAnd hang around to watch some poor girl blub\nAnd then they chase him down the avenue\nIncessantly pestering him to let 'em join the club\nHe knows how to put a cork in the fuss\nAnd just how to shut up the charming ones of us\nAnd I've seen him talking to your lady friend\n\nThere's a dust track waiting for betrayal\nWhere he'll teach you all the bits they've missed\n\nNice try, you cannot turn away but nice try\nNice try, you cannot turn away but nice try\nNice try, you cannot turn away but nice try\nNice try, you cannot turn away but nice try\nYou cannot turn away", 
    "title": "Catapult"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-choo-choo-lyrics", 
    "id": 343994, 
    "lyrics": "My baby wants to drive the train\nBut don't you let her, well, don't you let her touch the tracks\nI said, my baby wants to drive the train\nWell, all aboard, yeah, and don't forget to mind the gap\n\nDon't you let her, don't you know\nShe's sick and tired of\nBeing in the background, the passenger\nLet her drive the train, oh\n\nChoo-choo!\nWhy don't you let her drive the train? Oh\nChoo-choo!\nWhy don't you let her drive the train? Yeah\n\nShe's setting off from platform four\nMake your way down, we'll shut the door 'bout quart to five\nI said, she's setting off from platform four\nAnd they've decided that they're gonna let her drive\n\nWell, don't you let her, no, don't you know\nShe's sick and tired of\nBeing in the background, the passenger\nLet her drive the train, oh\n\nChoo-choo!\nWhy don't you let her drive the train? Oh\nChoo-choo!\nWhy don't you let her drive my train? Yeah, woah\n\n\nChoo-choo!\nChoo-choo!\nChoo-choo!\nChoo-choo!", 
    "title": "Choo Choo"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-chun-lis-spinning-bird-kick-lyrics", 
    "id": 2146198, 
    "lyrics": "Show us your special move (Laughing in the background)", 
    "title": "Chun-Li's Spinning Bird Kick"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-cigarette-smoke-lyrics", 
    "id": 248837, 
    "lyrics": "Get out the way, mister\nWith your short sharp tips\nNo, I won't read your lips right now\nAnd baby, hey\nYou send a shiver down my spine\nBut do you read my mind\nDo you?\nAnd you're looking pretty suspicious\nAnd probably planning a heist\nHe's wanting to go to the strippers\nIt makes him feel all nice\n(Cigarette smoke yeah)\nThe cigarette smoke in your eyes\nWatching a stripper and\n(Smacking a bloke yeah)\nSmacking a bloke here tonight\nGet out my way, mister\nWith your short sharp tips\nNo, I won't read your lips right now\nAnd baby, hey\nYou send a shiver down my spine\nBut do you read my mind\nDo you?\nHe's probably got stopped by a panda\nFor speeding on his way there\nFlashing of digital cameras\nFrom tourists in Trafalgar Square\n(Cigarette smoke yeah)\nThe cigarette smoke in your eyes\nWatching a stripper and\n(Snortin' some coke yeah)\nSnortin' some coke off her thighs\nBlah-blah-blah-blah-blah-blah\n(Cigarette smoke yeah)\nThe cigarette smoke in your eyes\nWatching a stripper and\n(Smacking a bloke yeah)\nSmacking a bloke here tonight\nAnd I just can't see for the\n(Cigarette smoke yeah)\nThe cigarette smoke in your eyes\nWatching a stripper and\n(Snortin' some coke yeah)\nSnortin' some coke off her thighs\nLalalalalala laaaaaaaoooo\nOwww", 
    "title": "Cigarette Smoke"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-cigarette-smoker-fiona-lyrics", 
    "id": 116361, 
    "lyrics": "Sat at the side of the pool at one of your houses\nWith wet white trousers on\nAnd worlds collide as the evening continues\nThe dignity fucks off\nHer brother's gone off to the strippers\nTo make up for all the lost time\nShe could have been one of the bitches\nBut she's actually alright\n\nCigarette smoker\nI'm sorry, but we're all unsure how much you've had\nBut we think that you ought to\nMaybe not have any more\n\nA country home, even if we really tried\nWouldn't cease to surprise us now\nAnd I bet your dad would like to give us all a slap\nWhen are your parents back? D'you know?\nWell, I never came from no ghetto\nBut it wasn't nowhere near here\nWell-spoken girls in stilettos\nAren't something to fear\n\nCigarette smoker\nI'm sorry, but we're all unsure how much you've had\nBut we think that you ought to\nMaybe not have any more\n\n\nCigarette smoker\nI'm sorry, but we're all unsure how much you've had\nBut we think that you ought to\nMaybe not have any more\n\nCigarette smoker\nCigarette smoke doesn't hide as well as you think\nAnd you'd think that it ought to\nAct as the perfect disguise", 
    "title": "Cigarette Smoker Fiona"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-come-together-lyrics", 
    "id": 1290753, 
    "lyrics": "Here come old flat top, he come\nGroovin' up slowly, he got\nJu-ju eyeballs, he want\nHoly rollers, he got\nHair down to his knees\nGot to be a joker, he just do what he please\nHe wear no shoeshine, he got\nToe jam football, he got\nMonkey finger, he shoot\nCoca-Cola, he say\nI know you, you know me\nOne thing I can tell you is: you got to be free\nCome together\nRight now\nOver me\nHe bag production, he got\nWalrus gumboot, he got\nOno sideboard, he one\nSpinal cracker, he got\nFeet down below his knees\nHold you in his armchair, you can feel his disease\nCome together\nRight now\nOver me\nHe roller coaster, he got\nEarly warning, he got\nMuddy water, he one\nMojo filter, he say\nOne and one and one is three\nGot to be good looking 'cause he's so hard to see\nCome together\nRight now\nOver me\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah\nCome together, yeah", 
    "title": "Come Together"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-cornerstone-lyrics", 
    "id": 90195, 
    "lyrics": "I thought I saw you in the Battleship\nBut it was only a look-a-like\nShe was nothing but a vision trick\nUnder the warning light\nShe was close, close enough to be your ghost\nBut my chances turned to toast\nWhen I asked her if I could call her your name\n\nI thought I saw you in the Rusty Hook\nHuddled up in a wicker chair\nI wandered over for a closer look\nAnd kissed whoever was sitting there\nShe was close, and she held me very tightly\n'Til I asked awfully politely\n\"Please, can I call you her name?\"\n\nAnd I elongated my lift home\nYeah, I let him go the long way round\nI smelt your scent on the seatbelt\nAnd kept my shortcuts to myself\n\nI thought I saw you in the Parrot's Beak\nMessing with the smoke alarm\nIt was too loud for me to hear her speak\nAnd she had a broken arm\nIt was close, so close that the walls were wet\nAnd she wrote it out in Letraset\n\"No, you can't call me her name\"\n\nTell me, where's your hiding place?\nI'm worried I'll forget your face\nAnd I've asked everyone\nI'm beginning to think I imagined you all along\n\nI elongated my lift home\nYeah, I let him go the long way round\nI smelt your scent on the seatbelt\nAnd kept my shortcuts to myself\n\nI saw your sister in the Cornerstone\nOn the phone to the middle man\nWhen I saw that she was on her own\nI thought she might understand\nShe was close, well, you couldn't get much closer\nShe said, \"I'm really not supposed to, but yes\nYou can call me anything you want\"", 
    "title": "Cornerstone"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-crying-lightning-lyrics", 
    "id": 96469, 
    "lyrics": "Outside the cafe by the cracker factory\nYou were practicing a magic trick\nAnd my thoughts got rude as you talked and chewed\nOn the last of your pick and mix\nSaid, \"You're mistaken if you're thinking\nThat I haven't been called cold before\"\nAs you bit into your strawberry lace\nAnd then offered me your attention in the form of a gobstopper\nIt's all you had left and it was going to waste\n\nYour pastimes consisted of the strange\nAnd twisted and deranged\nAnd I love that little game you had called Crying Lightning\nAnd how you'd like to aggravate the ice-cream man\nOn rainy afternoons\n\nThe next time that I caught my own reflection\nIt was on its way to meet you\nThinking of excuses to postpone\nYou never looked like yourself from the side\nBut your profile could not hide\nThe fact you knew I was approaching your throne\nWith folded arms you occupied the bench like toothache\nStood and puffed your chest out like you'd never lost a war\nAnd though I tried so not to suffer the indignity of reaction\nThere was no cracks to grasp or gaps to claw\n\nAnd your pastimes consisted of the strange\nAnd twisted and deranged\nAnd I hate that little game you had called Crying Lightning\nAnd how you'd like to aggravate the icky man on rainy afternoons\nUninviting, but not half as impossible as everyone assumes you are\nCrying Lightning\n\n\nYour pastimes consisted of the strange\nAnd twisted and deranged\nAnd I hate that little game you had called Crying Lightning\nCrying Lightning, Crying Lightning\nCrying Lightning, Crying Lightning\nYour pastimes consisted of the strange\nAnd twisted and deranged\nAnd I hate that little game you had called Crying", 
    "title": "Crying Lightning"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-crying-lightning-acoustic-version-lyrics", 
    "id": 2129708, 
    "lyrics": "Outside the cafe by the cracker factory\nYou were practicing a magic trick\nAnd my thoughts got rude\nAs you talked and chewed\nOn the last of your pick and mix\nSaid \"You're mistaken if your thinking that I haven't been called 'cold' before\"\nAs you bit into your strawberry lace\nAnd then offered me your attention in the form of a gobstopper\nIs all you have left and it was going to waste\n\n[Your pastimes consisted of the strange\nAnd twisted and deranged\nAnd I love that little game you had called\n\nCrying Lightning\nAnd how you like to aggravate the ice-cream man on rainy afternoons\n\nThe next time that I caught my own reflection\nIt was on it's way to meet you\nThinking of excuses to postpone\nYou never looked like yourself from the side\nBut your profile could not hide\nThe fact you knew I was approaching your throne\nWith folded arms you occupy the bench like toothache\nStood and puffed your chest out like you never lost a war\nAnd though I try so not to suffer the indignity of reaction\nThere was no cracks to grasp or gaps to claw\n\nYour pastimes consisted of the strange\nAnd twisted and deranged\nAnd I hate that little game you had called\n\nCrying Lightning\nAnd how you like to aggravate the icky man on rainy afternoons\n\nUninviting\nBut not half as impossible as everyone assumes you are\nCrying Lightning\n\nOh you were reading a book about some idiot and telling me about another\nI was so severely underwhelmed I thought I might never recover\nStraighten the rudder girl and sail me up stairs\nAnd go and find somebody who cares\nWell we might not be the perfect partners but tonight we make a pair\n\nCrying Lightning\nCrying Lightning\nCrying Lightning\nCrying Lightning\n\nCrying", 
    "title": "Crying Lightning (Acoustic Version)"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-curtains-closed-lyrics", 
    "id": 343996, 
    "lyrics": "I said I wanted it long but she cut it short\nAnd now I'm catching a cold\nI told you not but no crack in the doobie\nBut it was already rolled\n\nOh, I turned down my lights\nAnd my curtains weren't closed\nI turned down my lights\nAnd my curtains weren't closed\nOh well, I turned down my lights\nAnd my curtains weren't closed last night\nOh baby, I must be mad\n\nWell, I don't care about your massage oils\nIt's got my skin going red\nCause I'm a mad mother-fucker\nWith my curtains open\nSitting tucked up in bed\n\nI turned down my lights\nAnd my curtains weren't closed\nI turned down my lights\nAnd my curtains weren't closed\nOh well, I turned down my lights\nAnd my curtains weren't closed last night\nOh baby, I must be mad", 
    "title": "Curtains Closed"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-da-frame-2r-lyrics", 
    "id": 77845, 
    "lyrics": "007 and Brucey Wayne\nAre shitting themselves because there's another name\nComing to claim what is his to claim\nTen percent faster with a sturdier frame\nHe's certainly come into his own\nThere's one on his arm in every land that he roams\nAnd two consecutive nights alone\nAre a thing of the past as he has recently shown\n\nThey said he looks so handsome, stood not dancing\nDrawing you in like it's boring to him\nIt's a war you can't win and the first and the last\nAre two things you'll never be, my darling\n\nAnother roll around and another push and shove\nFurther away from the idea of love\nAnd his conclusion, it must be good\nOr when the penny has dropped with an incredible thud\nForgot to kick the tin\nHe knows where she's going, but don't know where she's been\nAnd as opposed to the other thing\nHe'll worry about it when it's trouble he's in\n\nThey said he looks so handsome, stood not dancing\nDrawing you in like it's boring to him\nIt's a war you can't win and the first and the last\nAre two things you'll never be, my darling\n(Two things you'll never be, my darling)\nTwo things you will never be, my darling\n(Two things you'll never be, my darling)\n\nWell, he sneered and sniffed and spat at my chat up-lines\nNot to feel like a twat at times, it's hard\nBut not for this kid, not when they come to you", 
    "title": "Da Frame 2R"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-dance-little-liar-lyrics", 
    "id": 96474, 
    "lyrics": "I heard the truth was built to bend\nA mechanism to suspend\nThe guilt is what you will require\nAnd still you've got to dance little liar\nJust like those fibs to pop and fizz\nAnd you'll be forced to take that awful quiz\nAnd you're bound to trip\nAnd she'll detect the fiction on your lips and dig a contradiction up\n\nAnd the clean coming will hurt\nAnd you can never get it spotless\nWhen there's dirt beneath the dirt\nThe liar takes a lot less time\n\nI'm sure it's clear and plain to read\nIt's not an alibi you need just yet\nOh, no, it's something for those beads of sweat\nYes, that will get you back to normal\nAnd after you have dabbed the patch\nYou'll breathe and then proceed to scratch\nThe varnish off that newly added calmness\nSo as not to raise any alarms too soon\n\nAnd the clean coming will hurt\nAnd you can never get it spotless\nWhen there's dirt beneath the dirt\nThe liar takes a lot less time\n\nThe liar takes a lot less time to decide on his saunter\nHave you got itchy bones? And in all your time alone\nCan you hack your mind being riddled\nWith the wrong memories?\n\n\nAnd the clean coming will hurt\nAnd you can never get it spotless\nWhen there's dirt between the dirt", 
    "title": "Dance Little Liar"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-dancing-shoes-lyrics", 
    "id": 58929, 
    "lyrics": "Get on your dancing shoes\nThere's one thing on your mind\nHoping they’re looking for you\nSure you'll be rummaging through\nOh and the shit, shock, horror\nYou've seen your future bride\nYeah, but it's oh so absurd\nFor you to say the first word so you're waiting and waiting and\n\nThe only reason that you came\nSo what you scared for?\nWell, don't you always do the same?\nIt's what you there for, don't you know?\n\nThe lights are flashing\nDown in here tonight\nAnd some might exchange a glance\nBut keep pretending to dance\nDon't act like it's not happening\nAs if it's impolite\nTo go and mention your name\nInstead you'll just do the same as they all do and hope for the best\n\nThe only reason that you came\nSo what you scared for?\nWell, don't you always do the same?\nIt's what you’re there for, but no\n\n\nGet on your dancing shoes\nYou sexy little swine\nHoping they’re looking for you\nSure you'll be rummaging through\nI said, the shit, shock, horror\nYou've seen your future bride, yeah\nYeah, but it's oh so absurd\nFor you to say the first word so you're waiting and waiting", 
    "title": "Dancing Shoes"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-dangerous-animals-lyrics", 
    "id": 100430, 
    "lyrics": "I'm pinned down by the dark\n\nBeen fighting with my sheets and nearly crying in my sleep\nYes, I'm battling that well-told gripe, the most frustrating type\nYou should have racing stripes the way you keep me in pursuit\nSharpen the heel of your boot and you press it in my chest\nAnd you make me wheeze, then to my knees you do promote me\n\nI'm pinned down by the dark\nA-N-I-M-A-L\nMakes my head pirouette\nMore than I would be willing to confess\nD-A-N-G-E-R-O-U-S\n\nThe light it fidgets through, the thoughts'll soon revert to you\nAbout as bashful as a tribal dance, the first and final chance\nAnd of course the audience of frighteners and fiends\nDivided up into two teams\nWhen the acrobat fell off the beam, she broke everyone's heart\n\nI'm pinned down by the dark\nA-N-I-M-A-L\nMakes my head pirouette\nMore than I would be willing to confess\nD-A-N-G-E-R-O-U-S\nD-A-N-G-E-R-O-U-S\nThe most unsuitable pet\nIt's been long enough now so let's\nMake a mess, lioness\n\nI'm pinned down by the dark\nI'm pinned down by the dark, oh-oh-oh\n\nD-A-N-G-E-R-O-U-S\nA-N-I-M-A-L\nD-A-N-G-E-R-O-U-S\nA-N-I-M-A-L", 
    "title": "Dangerous Animals"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-despair-in-the-departure-lounge-lyrics", 
    "id": 87708, 
    "lyrics": "He's pining for her in a people carrier\nThere might be buildings and pretty things to see like that but architecture won't do\nAlthough it might say a lot about the city or town\nI don't care what they've got, keep on turning 'em down\nIt don't say the funny things she does\nDon't even try and cheer him up because it just won't happen\n\nHe's got the feeling again, this time on the aeroplane\nThere might be tellies in the back of the seats in front, but Rodney and Del won't do\nAlthough it might take your mind off the aches and the pains\nLaugh when he falls through the bar but you're feeling the same\n'Cause she isn't there to hold your hand\nShe won't be waiting for you when you land\n\nAnd it feels like she's just nowhere near\nYou could well be out on your ear\nThis thought comes closely followed by the fear\nAnd the thought of it makes you feel a bit ill\n\nYesterday, I saw a girl who looked like someone you might knock about with\nAnd almost shouted\nAnd then reality kicked in within us, it seems as we become the winners\nYou lose a bit of summat, and half wonder if you won it at all\n\nAnd don't say owt 'cause you've got no idea\nAnd she's still nowhere near\nAnd the thought comes closely followed by the fear\nAnd the thought of it makes you feel a bit ill\n\nDespair in the departure lounge\nIt's one and they'll still be around at three\nNo signal and low battery\nWhat's happened to me?", 
    "title": "Despair in the Departure Lounge"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-diamonds-are-forever-lyrics", 
    "id": 1365845, 
    "lyrics": "Diamonds are forever\nThey are all I need to please me\nThey can stimulate and tease me\nThey won't leave in the night\nI've no fear that they might desert me\nDiamonds are forever\nHold one up and then caress it\nTouch it, stroke it and undress it\nI can see every part\nNothing hides in the heart to hurt me\nI don't need love\nFor what good will love do me?\nDiamonds never lie to me\nFor when love's gone\nThey'll luster on\nDiamonds are forever\nSparkling round my little finger\nUnlike men, the diamonds linger\nMen are mere mortals who are not worth going to your grave for\nI don't need love\nFor what good will love do me?\nDiamonds never lie to me\nFor when love's gone\nThey'll lustre on\nDiamonds are forever, forever, forever\nDiamonds are forever, forever, forever\nForever and ever", 
    "title": "Diamonds Are Forever"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-d-is-for-dangerous-lyrics", 
    "id": 93922, 
    "lyrics": "He knew what he wanted to say\nBut he didn't know how to word it\nThe dirty little Herbert was seeking an escape\nBut the place was well-guarded\nThe guiltiness that started\nSoon as the other part had stopped\n\nD is for delightful\nAnd try and keep your trousers on\nI think you should know you're his favourite worst nightmare\n\nD is for desperately trying to simulate\nWhat it was that was alright\nThree quarters of an hour ago\nThat had led him to be in a position\nOn every compromission\nAnd every other episode\n\nHe's nearing the brink but he thinks first\nA parallel universe perhaps could be the perfect scene\nHe's nearing the brink but he thinks first\nA parallel universe perhaps could be the perfect scene\nHe's nearing the brink but he thinks first\nA parallel universe perhaps could be the perfect scene\nHe's nearing the brink but he thinks first\nA parallel—I think you should know you're his favourite worst nightmare\n\nD is for delightful\nAnd try and keep your trousers on\nYou should know you're his favourite worst nightmare", 
    "title": "D Is for Dangerous"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-do-i-wanna-know-lyrics", 
    "id": 154314, 
    "lyrics": "Have you got colour in your cheeks?\nDo you ever get that fear that you can't shift the type\nThat sticks around like summat in your teeth?\nAre there some aces up your sleeve?\nHave you no idea that you're in deep?\nI've dreamt about you nearly every night this week\nHow many secrets can you keep?\n'Cause there's this tune I found\nThat makes me think of you somehow\nAn' I play it on repeat\nUntil I fall asleep\nSpillin' drinks on my settee\n\n(Do I wanna know?)\nIf this feelin' flows both ways?\n(Sad to see you go)\nWas sorta hopin' that you’d stay\n(Baby, we both know)\nThat the nights were mainly made\nFor sayin' things that you can’t say tomorrow day\n\nCrawlin' back to you\nEver thought of callin' when\nYou've had a few?\n'Cause I always do\nMaybe I'm too\nBusy bein' yours\nTo fall for somebody new\nNow, I've thought it through\nCrawlin' back to you\n\nSo have you got the guts?\nBeen wondering if your heart's still open\nAnd if so, I wanna know what time it shuts\nSimmer down an' pucker up\nI'm sorry to interrupt, it's just I'm constantly on the cusp\nOf tryin' to kiss you\nI don't know if you\nFeel the same as I do\nBut we could be together\nIf you wanted to\n\n(Do I wanna know?)\nIf this feelin' flows both ways?\n(Sad to see you go)\nWas sorta hopin' that you’d stay\n(Baby, we both know)\nThat the nights were mainly made\nFor sayin' things that you can’t say tomorrow day\n\nCrawlin' back to you (Crawlin' back to you)\nEver thought of callin' when\nYou've had a few? (You've had a few?)\n'Cause I always do ('Cause I always do)\nMaybe I'm too (Maybe I'm too busy)\nBusy bein' yours (Being yours)\nTo fall for somebody new\nNow, I've thought it through\nCrawlin' back to you\n\n(Do I wanna know?)\nIf this feelin' flows both ways?\n(Sad to see you go)\nWas sorta hopin' that you’d stay\n(Baby, we both know)\nThat the nights were mainly made\nFor sayin' things that you can’t say tomorrow day\n\n(Do I wanna know?)\nToo busy bein' yours to fall\n(Sad to see you go)\nEver thought of callin', darlin'?\n(Do I wanna know?)\nDo you want me crawlin' back to you?", 
    "title": "Do I Wanna Know?"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-do-me-a-favour-lyrics", 
    "id": 77653, 
    "lyrics": "Well, the mourning was complete\nAnd there was tears on the steering wheel dripping on the seat\nSeveral hours or several weeks\nI'd have the cheek to say they're equally as bleak\n\nIt's the beginning of the end\nThe car went up the hill and disappeared around the bend\nAsk anyone, they'll tell you that it's these times that it tends\nTo start to break in half, to start to fall apart, hold on to your heart\n\nAnd do me a favour and break my nose\nOr do me a favour and tell me to go away\nOr do me a favour and stop asking questions\n\nShe walked away while her shoes were untied\nAnd the eyes were all red, you could see that we'd cried\nAnd I watched and I waited 'til she was inside\nForcing a smile and waving goodbye\nCuriosity becomes a heavy load\nToo heavy to hold, too heavy to hold\nCuriosity becomes a heavy load\nToo heavy to hold, will force you to be cold\n\nDo me a favour and ask if you need some help\nShe said, \"Do me a favour and stop flattering yourself\"\nAnd to tear apart the ties that bind\nPerhaps \"Fuck off\" might be too kind\nPerhaps \"Fuck off\" might be too kind", 
    "title": "Do Me a Favour"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-dont-forget-whose-legs-youre-on-lyrics", 
    "id": 154315, 
    "lyrics": "The painted faces congregate in the mating season\nTo second homes, they go alone in no rush to leave them\n\nAnd there's a fountain and a scimitar-shaped yellow light\nAnd it picks you up and cuts you down to size\n\nWhen the people there and the furniture start to seem important\nWhen a moment more, when you catch the floor\nWith a vivid and absorbent sharpened arc\n\nLike the scimitar-shaped yellow light\nThat picks you up and cuts you down to size\n\nWell, I had questions for the tap dancer sat on my lap\nAnd she had child-proof caps on her answers\nStone blower, blow me a stone\nAnd show me that handsome enhancer\nShe had a rock on her throttle\nAnd a brown glass bottle full of shavings from the sun\nAlthough those shoes affect your step\nDon't forget whose legs you're on\n\nAnd there's a fountain and a scimitar-shaped yellow light\nAnd it picks you up and it cuts you down to size", 
    "title": "Don't Forget Whose Legs You're On"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-dont-sit-down-cause-ive-moved-your-chair-lyrics", 
    "id": 51737, 
    "lyrics": "Break a mirror, roll the dice\nRun with scissors through a chip-pan firefight\nGo into business with a grizzly bear\nBut just don't sit down 'cause I've moved your chair\n\nFind a well-known hard man and start a fight\nWear your shell suit on bonfire night\nFill in a circular hole with a peg that's square\nBut just don't sit down 'cause I've moved your chair\n\nOooh, yeah, yeah, yeah\nOooh, yeah, yeah, yeah\n\nBite the lightning and tell me how it tastes\nKung fu fighting on your roller skates\nDo the Macarena in the devil's lair\nBut just don't sit down 'cause I've moved your chair\n\nOooh, yeah, yeah, yeah\nOooh, yeah, yeah, yeah\nOooh, yeah, yeah, yeah\nOooh, yeah, yeah, yeah", 
    "title": "Don't Sit Down 'Cause I've Moved Your Chair"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-electricity-lyrics", 
    "id": 153107, 
    "lyrics": "Darlin’, tell me something I don’t know\nBe my baby, be my GTO\nCall me something no one else calls me\nI forget how I want it, that electricity\n\nWell, my heart was breaking and got left unlocked\nDidn’t see you sneak in, but I’m glad you stopped\nTell me something I don’t already know\nLike how'd you get your kisses to fill me with electricity?\n\nLove like locked horns, love like dominos\nBe my midnight, be my ebb and flow\nI forget how I want it, how it crept up on me\nIt takes over, electricity\n\nAnd my heart was breaking and got left unlocked\nDidn’t see you sneak in, but I’m glad you stopped\nTell me something I don’t already know\nLike how'd you get your kisses to fill me with electricity?\n\nSeparated, there I face it\nLove like thunder, love like falling snow\n\nTell me something I don’t already know\nLike how'd you get your kisses to fill me with electricity?", 
    "title": "Electricity"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-evil-twin-lyrics", 
    "id": 75909, 
    "lyrics": "You've never met before\nBut still she greets you like a long lost rock 'n' roll\nShe's definitely one of those\nWhere you'll go wherever she goes\nAnd with my body on my mind\nBoth stop talking at the exact same time\nTrying to think of ways to make her mine\nBut they're difficult to find\n\nIt's not what I need\nNo, your love's not what I need\nSo don't give it to me\n\nAnd she said\n\"Oh, well, I know this will sound cold, but I really have to go\nNo, it's not that I'm not free, there's nowhere I need to be\nIt's just your love's not what I need, so don't give it to me\"\n\nIt's not what I need\nNo, your love's not what I need\nSo don't give it to me\n\nAnd she said, \"Baby, how can I believe you?\nHow can I believe you when you can't believe your luck?\nNo point sticking to the plan when it's come unstuck\"\n\nIt's more a hunger than a thirst\nShe'll break your heart the second time\nBefore you know about the first\nLooks well equipped to leave you in the lurch\nBut you'd let her do her worst\nAnd it's not hard to tell\nIt's obvious the other angels faces fell\nWhen she told him that she had to go\nSwapped her wings and overcoat for something colourful\nTha knows\n\nIt's not what I need\nNo, your love's not what I need\nSo don't give it to me\nNo, your love's not what I need\nSo don't give it to me\nNo, your love's not what I need\nSo don't give it to me\nNo, your love's not what I need\nSo don't give it to me\nYour love's not what I need", 
    "title": "Evil Twin"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-fake-tales-of-san-francisco-lyrics", 
    "id": 87456, 
    "lyrics": "Fake tales of San Francisco\nEcho through the room\nMore point to a wedding disco\nWithout a bride or groom\nAnd there's a super cool band, yeah\nWith their trilbies and their glasses of white wine\nAnd all the weekend rockstars are in the toilets\nPracticing their lines\n\nI don't want to hear you, kick me out, kick me out\nI don't want to hear you, no, kick me out, kick me out\nI don't want to hear you, kick me out, kick me out\nI don't want to hear you, I don't want to hear your\n\nFake tales of San Francisco\nEcho through the air\nAnd there's a few bored faces at the back, all\nWishing they weren't there\nAnd as the microphone squeaks\nA young girl's telephone beeps\nYeah, she's dashing for the exit\nOh, she's running to the streets outside\n\"Oh, you've saved me\" she screams down the line\n\"The band were fucking wank and I'm not having a nice time\"\n\nI don't want to hear you, kick me out, kick me out\nI don't want to hear you, no, kick me out, kick me out\n\nYeah, but his bird said it's amazing though\nSo all that's left\nIs the proof that love's not only blind, but deaf\n\nHe talks of San Francisco, he's from Hunter's Bar\nI don't quite know the distance, but I'm sure that's far\nYeah, I'm sure it's pretty far\nAnd yeah, I'd love to tell you all my problem\nYou're not from New York City, you're from Rotherham\nSo get off the bandwagon, and put down the handbook\nYeah, yeah, yeah, yeah, yeah\n\nGet off the bandwagon and put down the handbook\nGet off the bandwagon and put down the handbook\nGet off the bandwagon and put down the handbook\nGet off the bandwagon and put down the handbook, yeah", 
    "title": "Fake Tales of San Francisco"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-fire-and-the-thud-lyrics", 
    "id": 101135, 
    "lyrics": "You showed me my tomorrow beside a box of matches\nA welcome threatening stir\nMy hopes of being stolen might just ring true\nDepends who you prefer\nIf it's true you're gonna run away\nTell me where, I'll meet you there\n\nAm I snapping the excitement\nIf I pack away the laughter and tell you how it feels?\nAnd does burden come to meet ya\nIf I've questions of the feature that rolls on your dream reel?\nThe day after you stole my heart\nEverything I touched told me\nIt would be better shared with you, with you\n\nAnd now you're hiding in my soup\nAnd this book reveals your face\nAnd you're splashing in my eyelids\nAs the concentration continually breaks\nI did request the mark you cast\nDidn't heal as fast\nI hear your voice in silences\nWill the teasing of the fire be followed by the thud?\n\nIn the jostling crowd, you're not allowed to tell the truth\nAnd the photo booth's a liar\nAnd there's a sharpened explanation\nBut there's no screaming reason to inquire\nI'd like to poke them in their prying eyes with things\nThey'd never see if it smacks them in their temples", 
    "title": "Fire and the Thud"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-fireside-lyrics", 
    "id": 213185, 
    "lyrics": "I can't explain but I wanna try\nThere's this image of you and I\nAnd it goes dancing by\nIn the morning and the night time\nThere's all these secrets that I can't keep\nLike in my heart there's that hotel suite\nAnd you lived there so long\nIt's kind of strange now you're gone\n\nI'm not sure if I should show you what I've found\nHas it gone for good, or is it coming back around?\nIsn't it hard to make up your mind\nWhen you're losing and your fuse is fireside?\n\nThere's all those places we used to go\nAnd I suspect you already know\nBut that place on memory lane you like still looks the same\nBut something about it's changed\n\nI'm not sure if I should show you what I've found\nHas it gone for good, or is it coming back around?\nIsn't it hard to make up your mind\nWhen you're losing and your fuse is fireside?\n\nAnd I thought I was yours forever\nOr maybe I was mistaken\nBut I just cannot manage to make it through the day\nWithout thinking of you lately\n\n\nI'm not sure if I should show you what I've found\nHas it gone for good, or is it coming back around?\nIsn't it hard to make up your mind\nWhen you're losing and your fuse is fireside?", 
    "title": "Fireside"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-fluorescent-adolescent-lyrics", 
    "id": 88856, 
    "lyrics": "You used to get it in your fishnets\nNow you only get it in your night dress\nDiscarded all the naughty nights for niceness\nLanded in a very common crisis\nEverything's in order in a black hole\nNothing seems as pretty as the past though\nThat Bloody Mary's lacking in Tabasco\nRemember when you used to be a rascal?\n\nOh, the boy's a slag, the best you ever had\nThe best you ever had is just a memory and those dreams\nBut not as daft as they seem, not as daft as they seem\nMy love, when you dream them up\n\nFlicking through a little book of sex tips\nRemember when the boys were all electric?\nNow when she's told she's gonna get it\nI'm guessing that she'd rather just forget it\nClinging to not getting sentimental\nSaid she wasn't going but she went still\nLikes her gentlemen not to be gentle\nWas it a Mecca dauber or a betting pencil?\n\nOh, the boy's a slag, the best you ever had\nThe best you ever had is just a memory and those dreams\nWeren't daft as they seem, not as daft as they seem\nMy love, when you dream them up\nOh, Flo, where did you go?\nWhere did you go? Where did you go?\n\nYou're falling about\nYou took a left off Last Laugh Lane\nJust sounding it out\nBut you're not coming back again\nYou're falling about\nYou took a left off Last Laugh Lane\nYou were just sounding it out\nBut you're not coming back again\n\nYou used to get it in your fishnets\n(Falling about)\nNow you only get it in your night dress\nDiscarded all the naughty nights for niceness\n(You took a left off Last Laugh Lane)\nLanded in a very common crisis\nEverything's in order in a black hole\n(You were just sounding it out)\nNothing seems as pretty as the past though\nThat Bloody Mary's lacking in Tabasco\n(You're not coming back again)\nRemember when you used to be a rascal?", 
    "title": "Fluorescent Adolescent"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-four-out-of-five-lyrics", 
    "id": 3629328, 
    "lyrics": "Advertise in imaginative ways, start your free trial today\nCome on in, the water's lovely\nLook, you could meet someone you like\nDuring the meteor strike, it is that easy\nLunar surface on a Saturday night, dressed up in silver and white\nWith coloured Old Grey Whistle Test lights\n\nTake it easy for a little while\nCome and stay with us, it’s such an easy flight\nCute new places keep on popping up\nSince the exodus, it's all getting gentrified\nI put a taqueria on the roof, it was well reviewed\nFour stars out of five\nAnd that's unheard of\n\nMr. Bridge and Tunnel on the Starlight Express\nThe head of special effects in my mind’s eye\nHokey Cokey with the opposite sex\nThe things you try to forget, doesn't time fly?\nI'm in no position to give advice, I don't want to be nice\nAnd you know that\n\nTake it easy for a little while\nCome and stay with us, it's such an easy flight\nCute new places keep on popping up\nAround Clavius, it's all getting gentrified\nThe Information-Action Ratio is the place to go\nAnd you will not recognise the old headquarters\n\nAll the nights that never happened and the days that don't exist\nAt the Information-Action Ratio\nThe only time that we stop laughing is to breathe or steal a kiss\nI can get you on the list for all the clubs\nI can lift you up another semitone\n\nTake it easy for a little while (Take it easy for a little while)\nCome and stay with us, it's such an easy flight\nCute new places keep on popping up\n(Cute new places keep on popping up)\nSince the exodus, it’s all getting gentrified\nThe Information-Action Ratio (The Information-Action Ratio)\nIs the place to go, four stars out of five\nTake it easy for a little while (Take it easy for a little while)\nCome and stay with us, now, it’s such an easy flight\nCute new places keep on popping up\n(Cute new places keep on popping up)\nAround Clavius, it's all getting gentrified\nI put a taqueria on the moon (The Information-Action Ratio)\nIt got rave reviews, four stars out of five\n\nTake it easy for a little while (Take it easy for a little while)\nCome and stay with us, four stars out of five\nTake it easy for a little while (Take it easy for a little while)\nCome and stay with us, four stars out of five\nTake it easy for a little while (Take it easy for a little while)\nCome and stay with us, four stars out of five\n(Take it easy for a little while)\nFour stars out of five", 
    "title": "Four Out of Five"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-fox-theater-setlist-lyrics", 
    "id": 227432, 
    "lyrics": "Set List, September 26th, 2013\nDo I Wanna Know?\nBrianstorm\nDancing Shoes\nDon't Sit Down Cause I've Moved Your Chair\nTeddy Picker\nCrying Lightning\nSnap Out of It\nEvil Twin\nOld Yellow Bricks\nWhy'd You Only Call Me When You're High?\nArabella\nPretty Visitors\nI Bet You Look Good on the Dancefloor\nCornerstone\nNo. 1 Party Anthem\nFluorescent Adolescent\nKnee Socks\nEncore\nOne for the Road\nDo Me a Favour\nR U Mine?", 
    "title": "Fox Theater Setlist"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-fright-lined-dining-room-lyrics", 
    "id": 193507, 
    "lyrics": "You thrive on dancing in our laps before the more familiar chaps\nAnd all the curtain leads to fever\nWe watched the womaniser cry, and in the last sip\nYou and I declared we might require a breather\nI am the truth's true truant, I can feign excitement\nFluently as solid as I can busk shock\nWith well-presented merriment and I know all too well\nI shouldn't break the key off in the lock\n\nAnd the tumble splits the fray\nRevealing silk can fit\nIn the fright lined dining room\nThrow a gaze towards them while they feast\n\nThe days drag their heels when you're not there to crack the whip\nAnd the weeks wait to burst like a sachet of brats\nThe old pantomime villain follows my coat\nAnd he hides where it hangs and he spies through the slots\nAnd meanwhile in the desert's only costume shop\nThe cowls hang and wait to rot away the identities of the willing\n\nDrowned bags of sugar in the night\nRocketing shutter doors despite the shop not opening for hours\nYou can itch, flap and whistle and try to avoid the top\nAs I scribbled over dribble, you were snoring, showing off\n\nThe tumble splits the fray\nRevealing silk can fit\nIn the fright lined dining room\nThrow a gaze towards them while they feast", 
    "title": "Fright Lined Dining Room"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-from-the-ritz-to-the-rubble-lyrics", 
    "id": 84105, 
    "lyrics": "Well, last night these two bouncers\nAnd one of 'em's alright\nThe other one's a scary'un\nAn his way or no way; totalitarian\nHe's got no time for you looking or breathing\nHow he don’t want you to\nSo step out the queue\nHe makes examples of you\nAnd there's nothing you can say\nBehind they go through to the bit where you pay\nAnd you realise then that it's finally the time\nTo walk back past ten-thousand eyes in the line\nAnd you can swap jumpers and make another move\nInstilled in your brain, you've got something to prove\nTo all the smirking faces and the boys in black\nWhy can't they be pleasant? Why can't they have a laugh?\nHe's got his hand in your chest, he wants to give you a duff\nWell, secretly I think they want you all to kick off\nThey want arms flying everywhere\nAnd bottles as well\nIt's just something to talk about\nA story to tell, yeah\n\nWell, I'm so glad they turned us all away\nWe'll put it down to fate\nI said a thousand million things\nThat I could never say this morning\nGot too deep\nBut how deep is too deep?\n\nWell, this town's a different town today\nSaid, this town's a different town to what it was last night\nYou couldn't have done that on a Sunday\nAnd that girl's a different girl today\nSaid, that girl's a different girl to her you kissed last night\nYou couldn't have done that on a Sunday\nOf course not\n\nWell, I'm so glad they turned us all away\nWe'll put it down to fate\nI thought a thousand million things\nThat I could never think this morning\nGot too deep\nBut how deep is too deep?\n\nLast night, what we talked about\nIt made so much sense\nBut now the haze has ascended\nIt don't make no sense anymore\nI said, last night, what we talked about\nIt made so much sense\nBut now the haze has ascended\nIt don't make no sense anymore, oh\n\nDa-da, da-da-da\nDa-da, da-da-da, da-da-da-da\nDa-da, da-da-da, da-da-da-da-da", 
    "title": "From the Ritz to the Rubble"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-golden-trunks-lyrics", 
    "id": 3629327, 
    "lyrics": "Last night when my psyche's\nSubcommittee sang to me in its scary voice\nYou slowly dropped your eyelids\nWhen true love takes a grip, it leaves you without a choice\n\nAnd in response to what you whispered in my ear\nI must admit, sometimes I fantasise about you too\n\nThe leader of the free world\nReminds you of a wrestler wearing tight golden trunks\nHe's got himsen a theme tune\nThey play it for him as he makes his way to the ring\n\nAnd in response to what you whispered in my ear\nI must admit, sometimes I fantasise about you too\n\nIn the daytime\nBendable figures with a fresh new pack of lies\nSummat else to publicise\nI'm sure you've heard about enough\n\nSo in response to what you whispered in my ear\nI'll be upfront, sometimes I fantasise about you too", 
    "title": "Golden Trunks"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-hold-on-were-going-home-lyrics", 
    "id": 1385435, 
    "lyrics": "I got my eyes on you, you're everything that I see\nI want your hot love and emotion endlessly\nI can't get over you, you left your mark on me\nI want your hot love and emotion endlessly\nBecause you're a good girl and you know it\nYou act so different around me\nBecause you're a good girl and you know it\nI know exactly who you could be\nJust hold on, we're going home\nJust hold on, we're going home\nIt's hard to do these things alone\nJust hold on, we're going home\nI got my eyes on you, you're everything that I see\nI want your hot love and emotion endlessly\nI can't get over you, you left your mark on me\nI want your hot love and emotion endlessly\nBecause you're a good girl and you know it\nYou act so different around me\nBecause you're a good girl and you know it\nI know exactly who you could be\nJust hold on, we're going home\nJust hold on, we're going home\nIt's hard to do these things alone\nJust hold on, we're going home\nYou're the girl, you're the one\nGave you everything I love\nI think there's something, baby\nI think there's something, baby\nYou're the girl, you're the one\nGave you everything I love\nI think there's something, baby\nI think there's something, baby\nBecause you're a good girl and you know it\nYou act so different around me\nBecause you're a good girl and you know it\nI know exactly who you could be\nJust hold on, we're going home\nJust hold on, we're going home\nIt's hard to do these things alone\nJust hold on, we're going home", 
    "title": "Hold On, We're Going Home"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-humbug-booklet-annotated", 
    "id": 2871788, 
    "lyrics": "", 
    "title": "Humbug [Booklet]"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-i-bet-you-look-good-on-the-dancefloor-lyrics", 
    "id": 74885, 
    "lyrics": "Stop making the eyes at me, I'll stop making the eyes at you\nWhat it is that surprises me is that I don't really want you to\n\nAnd your shoulders are frozen (Cold as the night)\nOh, but you're an explosion (You're dynamite)\nYour name isn't Rio, but I don't care for sand\nAnd lighting the fuse might result in a bang, b-b-bang-oh\n\nI bet that you look good on the dancefloor\nI don't know if you're looking for romance or\nI don't know what you're looking for\nI said, I bet that you look good on the dancefloor\nDancing to electro-pop like a robot from 1984\nWell, from 1984\n\nI wish you'd stop ignoring me because it's sending me to despair\nWithout a sound, yeah, you're calling me and I don't think it's very fair\n\nThat your shoulders are frozen (Cold as the night)\nOh, but you're an explosion (You're dynamite)\nYour name isn't Rio, but I don't care for sand\nAnd lighting the fuse might result in a bang, b-b-bang-oh\n\nI bet that you look good on the dancefloor\nI don't know if you're looking for romance or\nI don't know what you're looking for\nI said, I bet that you look good on the dancefloor\nDancing to electro-pop like a robot from 1984\nWell, from 1984\n\nAnd no there in't no love, no Montagues or Capulets\nJust banging tunes and DJ sets and\nDirty dancefloors and dreams of naughtiness\n\nWell I bet that you look good on the dancefloor\nI don't know if you're looking for romance or\nI don't know what you're looking for\nI said, I bet that you look good on the dancefloor\nDancing to electro-pop like a robot from 1984\nSaid, from 1984", 
    "title": "I Bet You Look Good on the Dancefloor"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-idst-lyrics", 
    "id": 344001, 
    "lyrics": "I wrote, \"I was here,\" I.D.S.T\nOn the bathroom mirror, I.D.S.T\n\nI.D.S.T., I.D.S.T., I.D.S.T\nI.D.S.T., I.D.S.T., I.D.S... T\n\nI wrote, \"Mark for Jenny,\" I.D.S.T\nWith a drawing compass on the backseat\n\nI.D.S.T., I.D.S.T., I.D.S.T\nI.D.S.T., I.D.S.T., I.D.S... T\n\n\nI.D.S.T., I.D.S.T\nI.D.S.T., I.D.S... T", 
    "title": "I.D.S.T."
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-if-you-found-this-its-probably-too-late-lyrics", 
    "id": 124202, 
    "lyrics": "Under constant correction, a fraud, a fraud\nSomeone's perception, trying not to bore\nI'm a cold-hearted kidder, applaud, applaud\nIf you're the highest bidder, I'm yours\nYou think we have pathetic sets\nAnd we're not sure of the etiquette\nAlthough we know they're pathetic sets\nAnd we're not sure of the etiquette\n\nAnd if you found this, it's probably too late\nClinically cynical, hereditary hate\nIf you found this, it's probably too late\nApproaching the pinnacle, I'm running out of mates\n\nIf we concentrate on being off the cuff\nNot sure we're ready, but probably rough\nFrightened that honesty isn't enough\nAnd it's nothing on the early stuff", 
    "title": "If You Found This It's Probably Too Late"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-if-you-were-there-beware-lyrics", 
    "id": 71485, 
    "lyrics": "If you were there, beware the serpent soul pinchers\nThree-hundred and fifty \"No, thank you\"s and nobody flinches\nGo on, girl, go on, give us something gruesome\nWe require your grief, the thugs help the thieves\nAs they're trying to rob the words from her gob and\nTake the source of the innocence\n\nIf you were there, beware the serpent soul pinchers\nCan't you sense she was never meant to fill column inches\nAin't you had enough? What you're trying to dig up\nIsn't there to be dug; the thieves help the thugs\nAs they're trying beat the good grace of a sweetheart\nOut to the point she'll comply\n\nAnd why leave her on her own?\nIf I'd have known then I wouldn't have said it\nI wouldn't have said it if I would have known\nWhy leave her on her own?\nIf I predicted tears then I wouldn't have said it\nI wouldn't have said it if I would have known\n\n\nThere's a circle of witches, ambitiously vicious they are\nOur attempts to remind them of reason won't get us that far\nBut I don't know what it is that they want\nI don't know what it is that they want\nBut I haven't got it to give\nAnd she hasn't got it to give", 
    "title": "If You Were There, Beware"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-i-havent-got-my-strange-lyrics", 
    "id": 193512, 
    "lyrics": "When I got back from fixing my hair\nYou were directing the traffic\nLetting your story slip on the snow\nAs if the transmission was automatic\nIt's arguable that I shouldn't've been there\nIt was fortunate timing\nI had a hole in the pocket of my favourite coat\nAnd my love dropped into the lining\n\n(Have you got your strange?) Not on me\nI haven't got my strange\n(Have you got your strange?) Not on me\n\nYou can't sleep until you've sat on the steps to weep\n'Til you feel like you've wept, yeah\n(As long as you don't forget your strange)\n\n(Have you got your strange?) No, not on me\nI haven't got my strange\n(Have you got your strange?) Not on me\nI haven't got my strange\nI've better fetch my strange\nI haven't got my strange\nI haven't got my strange", 
    "title": "I Haven't Got My Strange"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-i-wanna-be-yours-lyrics", 
    "id": 213161, 
    "lyrics": "I wanna be your vacuum cleaner\nBreathin' in your dust\nI wanna be your Ford Cortina\nI will never rust\nIf you like your coffee hot\nLet me be your coffee pot\nYou call the shots, babe\nI just wanna be yours\n\nSecrets I have held in my heart\nAre harder to hide than I thought\nMaybe I just wanna be yours\nI wanna be yours\nI wanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\n\nLet me be your 'leccy meter\nAn' I'll never run out\nLet me be the portable heater\nThat you’ll get cold without\nI wanna be your setting lotion (Wanna be)\nHold your hair in deep devotion (How it deep?)\nAt least as deep as the Pacific Ocean\nI wanna be yours\n\nSecrets I have held in my heart\nAre harder to hide than I thought\nMaybe I just wanna be yours\nI wanna be yours\nI wanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\nWanna be yours\n\nI wanna be your vacuum cleaner (Wanna be yours)\nBreathin' in your dust (Wanna be yours)\nI wanna be your Ford Cortina (Wanna be yours)\nI will never rust (Wanna be yours)\nI just wanna be yours (Wanna be yours)\nI just wanna be yours (Wanna be yours)\nI just wanna be yours (Wanna be yours)\nI just wanna be yours (Wanna be yours)", 
    "title": "I Wanna Be Yours"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-i-want-it-all-lyrics", 
    "id": 213210, 
    "lyrics": "Blind faith, heartache\nMind games, mistakes\nMy sweet fireball\nMy sweet rigmarole\n\nI want it all\nI want it all\n\nOld dogs, new tricks\nCan you feel it?\nSpace age country girl\nStone cold miracle\n\nI want it all\nI want it all\n\nAnd then suddenly it hit me, it’s a year ago\nSince I drank miniature whiskey and we shared your Coke\nSaid, ain’t it just like you to kiss me and then hit the road?\nLeave me listening to the Stones, 2000 Light Years From Home\n\nShoo-wop, shoo-wop shoo-wop, shoo-wop\nShoo-wop, shoo-wop shoo-wop, shoo-wop\nShoo-wop, shoo-wop shoo-wop, shoo-wop\nShoo-wop, shoo-wop shoo-wop, shoo-wop\nShoo-wop, shoo-wop\n\nI want it all\nI want it all\nI want it all\nI want it all\nI want it all", 
    "title": "I Want It All"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-joining-the-dots-lyrics", 
    "id": 262817, 
    "lyrics": "Been trying to think of something colourful for the season\nPull the wool over the gullible for no reason\nYou are all I have these days, shake it up and run away\nWith the night squabbling behind you\n\nFrom the smoke in your hair\nTo the blood in your bruise\nAnd the bows on the shoes you kicked off\nI'm joining the dots\nI'm joining the dots\n\nI thought I heard them talking in their sleep yesterday\nAnd I tried but I just can't believe a word they say\nHurry up, they'll be here soon, sleeping in the afternoon\nWhile the rain is trying to prove a point outside\n\nFrom the smoke in your hair\nTo the blood in your bruise\nAnd the bows on the shoes you kicked off\nI'm joining the dots\nI'm joining the dots\nI'm joining the dots\n\nThose people make me cough\nCan't the flame come up to the moth for a change?\nAnd darling, if it's all the same to you\nI'll have you to myself\n\nI'm joining the dots\nI'm joining the dots\n\nHave a listen to it, I don't know...", 
    "title": "Joining the Dots"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-katy-on-a-mission-lyrics", 
    "id": 3577024, 
    "lyrics": "In this room of darkness, I ain't undercover\nBut that won't stop my prowess rubbing off onto another\nElevating higher as my body's moving lower\nNow I'll reach my element, you better move over\nBut he doesn't, he blocks my way\nI try to push past, but he wants to play\nSo I sip his drink as I hold his gaze\nAs we erupt into the room\nAnd feel the sub go boom\nA feeling easy to resume\nThis right here, I swear, will end too soon\nSink in to the tune\nAs I inhale the fumes\nA feeling easy to resume\nThis right here, I swear, will end too soon\nMy limbs seem to move what the beats dictate to me\nI push into the middle, the sound becomes a part of me\nTaking me back to that sweet familiarity\nWatching my adrenaline rise, I feel the eyes on me\nSip the bottle now, don't be slow\nKeep up with me as we lose control\nKeep up with me as we lose control\nAs we erupt into the room\nI feel the sub go boom\nA feeling easy to resume\nThis right here, I swear, will end too soon\nSink in to the tune\nAs I inhale the fumes\nA feeling easy to resume", 
    "title": "Katy On a Mission"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-knee-socks-lyrics", 
    "id": 213246, 
    "lyrics": "You got the lights on in the afternoon\nAn' the nights are drawn out long\nAnd you’re kissin' to cut through the gloom\nWith a cough drop coloured tongue\nAnd you were sittin' in the corner\nWith the coats, all piled high\nAnd I thought you might be mine\nIn a small world on an exceptionally\nRainy Tuesday night\nIn the right place and time\n\nWhen the zeros line up on the\n24-hour clock\nWhen you know who’s callin'\nEven though the number is blocked\nWhen you walked around your house\nWearin' my sky blue Lacoste\nAnd your knee socks\n\nWell, you cured my January blues\nYeah, you made it all alright\nI got a feelin' I might have lit the very fuse\nThat you were tryin' not to light\nYou were a stranger in my phonebook\nI was actin' like I knew\n‘Cause I had nothin' to lose\nWhen the winter’s in full swing\nAnd your dreams just aren’t comin' true\nAin’t it funny what you’ll do?\n\nWhen the zeros line up on the\n24-hour clock\nWhen you know who’s callin'\nEven though the number is blocked\nWhen you walked around your house\nWearin' my sky blue Lacoste\nAnd your knee socks\n\nThe late afternoon, the ghost in your room\nThat you always thought didn’t approve of you knockin' boots\nNever stopped you lettin' me get hold of the sweet spot\nBy the scruff of your knee socks\n\nYou and me could have been a team\nEach had a half of a king and queen seat\nLike the beginning of Mean Streets\nYou could be my baby (Could be my baby)\nYou and me could have been a team\nEach had a half of a king and queen seat\nLike the beginning of Mean Streets\nYou could be my baby (Could be my baby)\n\nAll the zeros lined up\nBut the number’s blocked\nWhen you’ve come undone\n\nYou and me could have been a team\nEach had a half of a king and queen seat\nLike the beginning of Mean Streets\nYou could be my baby (Could be my baby)\nYou and me could have been a team\nEach had a half of a king and queen seat\nLike the beginning of Mean Streets\nYou could be my baby (Could be my baby)\n\nWhen the zeros line up on the\n24-hour clock\nWhen you know who’s callin'\nEven though the number is blocked\nWhen you walked around your house\nWearin' my sky blue Lacoste\nAnd your knee socks\nWhen the zeros line up on the\n24-hour clock\nWhen you know who’s callin'\nEven though the number is blocked\nWhen you walked around your house\nWearin' my sky blue Lacoste\nAnd your knee socks\n\nKnee socks\nKnee socks", 
    "title": "Knee Socks"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-knock-a-door-run-lyrics", 
    "id": 152424, 
    "lyrics": "Watch me, watch me go\nWell I'm struttin' up ever so slow\nAnd now sting me, get in the groove\nCause they're bangin' on the door\nYes they're hard and they'll make a move\n\nWe're wakin' up those sleepers\nYou know we're so mischievous\nJust what you'll do to keep us entertained\nWe're wakin' up those sleepers\nYou know we're so mischievous\nJust what you'll do to keep us entertained\n\n(Knock, run)\nShe's got you up and she's run, run, runnin' away\n(Knock, run)\nYou're knockin' first if you think that you're comin' to play\nAnd I don't mind\nCause all the time you're talkin' at me\nNo I don't mind at all\n\nOh well cap-guns and polystyrene planes\nWell I'm buyin' penny bubblies with my change\nCause sting me, get in the groove\nCause they're bangin' on the door\nYes they're hard and they'll make a move\n\nWe're wakin' up those sleepers\nYou know we're so mischievous\nJust what you'll do to keep us entertained\nWell now she said she's going\nShe's got the towel to throw in\nWas just about to blow him and ran away", 
    "title": "Knock a Door Run"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-leave-before-the-lights-come-on-lyrics", 
    "id": 120088, 
    "lyrics": "Well, this is a good idea\nHe wouldn't do it if it wasn't\nHe wouldn't do it if it wasn't one\nWell, my friend fancies you\nOh, what a way to begin it all\nYou said, \"They're always exciting words to hear\"\n\nAnd they woke up together not quite realising how\nAwkwardly stretching and yawning\nIt's always hard in the morning\nAnd I suppose that's the price you pay\nWell, oh, it isn't what it was\nShe's thinking he looks different today\nAnd now there's nothing left to guess now\n\nThey left before the lights came on\nBecause they didn't want to ruin what it was that was brewing\nBefore they absolutely had to\nAnd how can you wake up with someone you don't love\nAnd not feel slightly fazed by it?\nOh, he had a struggle\n\nAnd they woke up together not quite realising how\nAwkwardly stretching and yawning\nIt's always hard in the morning\nAnd I suppose that's the price you pay\nWell, oh, it isn't what it was\nShe's thinking he looks different today\nAnd now there's nothing left to guess now\n\nWell, quick, let's leave before the lights come on\n'Cause then you don't have to see\n'Cause then you don't have to see what you've done\nWell, quick, let's leave before the lights come on\n'Cause then you don't have to see\n'Cause then you don't have to see what you've done\n\n\nI'll walk you up, what time's the bus come?\nI'll walk you up, what time's the bus come?\nI'll walk you up, what time's the bus come?\nI'll walk you up", 
    "title": "Leave Before the Lights Come On"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-library-pictures-lyrics", 
    "id": 51736, 
    "lyrics": "I'm in a vest\n\nLibrary pictures of the quickening canoe\nThe first of its kind to get to the moon\nTrust some ellipses to chase you 'round the room\nThrough curly straws and metaphors and goo\n\nBeen watching all the neon blossom flickering\nYou look as if you've all forgotten where you've been\nGoing riding through the thunder suckle fuzz canyon\nTen, nine, eight, seven, six, five, four, three, two, one\n\nLibrary pictures of the quickening canoe\nThe first of its kind to get to the moon\nGive me an eeny, meeny, miny, moe\nOr an ip, dip, dog shit rock and roll", 
    "title": "Library Pictures"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-little-illusion-machine-wirral-riddler-lyrics", 
    "id": 344006, 
    "lyrics": "Swinging room to room\nPlanting something new\nI've ridden the riddle, I'll do it again\nBack to the Wirral where it all began\nWirral riddler\n\nSend a letter to me, baby, I'm on the edge of my seat\nSend a letter to me, baby, little illusion machine\n\nRiding through the gloom\nSomething beautiful\nHe's ridden the riddle, he'll do it again\nHe's going back to the Wirral where it all began\nWirral riddler\n\nSend a letter to me, baby, I'm on the edge of my seat\nSend a letter to me, baby, little illusion machine\nI tried it and I liked it, but it just never gets close enough\nSend a letter to me, baby\n\n(Wirral) So tell me where have you been?\n(Wirral) Little illusion machine\n(Wirral) Hoping tonight is gonna send me back to you\nWow!", 
    "title": "Little Illusion Machine (Wirral Riddler)"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-love-is-a-laserquest-lyrics", 
    "id": 51734, 
    "lyrics": "Do you still feel younger than you thought you would by now\nOr darling, have you started feeling old yet?\nDon't worry, I'm sure that you're still breaking hearts\nWith the efficiency that only youth can harness\nAnd do you still think love is a laserquest\nOr do you take it all more seriously?\nI've tried to ask you this in some daydreams that I've had\nBut you're always busy being make-believe\n\nAnd do you look into the mirror to remind yourself you're there\nOr have somebody's goodnight kisses got that covered?\nWhen I'm not being honest\nI pretend that you were just some lover\n\nNow I can't think of air without thinking of you\nI doubt that comes as a surprise\nAnd I can't think of anything to dream about\nI can't find anywhere to hide\n\nAnd when I'm hanging on by the rings around my eyes\nAnd I convince myself I need another\nAnd for a minute, it gets easy\nTo pretend that you were just some lover\n\n\nWhen I'm pipe and slippers and rocking chair\nSinging dreadful songs about summer\nWill I have found a better method of\nPretending you were just some lover?\nWill I have found a better method of\nPretending you were just some lover?", 
    "title": "Love Is a Laserquest"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-love-machine-lyrics", 
    "id": 1008316, 
    "lyrics": "Ladies, you're damn right, you can't read a man's mind\nWe're living in two tribes and heading for war\nWell, nobody's perfect, we've all gotta work it\nBut fellas, we're worth it so don't break the law\nYour call's late, big mistake\nYou gotta hang about in limbo for as long as I take\nNext time, read my mind and I'll be good to you\nWe're gift-wrapped kitty cats\nWe're only turning into tigers when we gotta fight back\nLet's go, Eskimo, out into the blue\nCome take my hand, understand that you can\nYou're my man and I need you tonight\nCome make my dreams, honey, hard as it seems\nLoving me is as easy as pie\n(Ai)\nI'm just a love machine, feeding my fantasy\nGive me a kiss or three and I'm fine\nI need a squeeze a day 'stead of this negligee\nWhat will the neighbors say this time?\nI've been going crazy while you sleep\nThinking of a language that the two of us can speak\nSo Mr. Prehistoric, make your wheel\nAnd I'll breathe underwater 'cause I like the way it feels\nI said your call's late, big mistake\nYou gotta hang about in limbo for as long as I take\nNext time, read my mind and I'll be good to you\nWe're gift-wrapped kitty cats\nWe're only turning into tigers when we gotta fight back\nLet's go, Eskimo, out into the blue\nCome take my hand, understand that you can\nYou're my man and I need you tonight\nCome make my dreams, honey, hard as it seems\nLoving me is as easy as pie\nI'm just a love machine, feeding my fantasy\nGive me a kiss or three and I'm fine\nI need a squeeze a day 'stead of this negligee\nWhat will the neighbors say this time?\nOh, it's very new\nCan anybody tell me what to do?\nOh, this feeling's very strange\nCan anybody tell me what's your game?\n(Oh)\nA little education\n(Oh)\nTo give you motivation\n(Oh)\nWe'll turn the situation round\n(Oh, Oh)\n(Oh)\nMaking you a stranger\n(Oh)\nI'll only re-arrange ya for now\n(Oh)\nI'm just a love machine\n(Oh)\nTo give you motivation\n(Oh)\nI'm just a love machine\n(Oh)\nI'm just a love machine\n(Oh)\nTo give you motivation\n(Oh)\nI'm just a love machine", 
    "title": "Love Machine"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-mad-sounds-lyrics", 
    "id": 183827, 
    "lyrics": "Mad sounds, in your ears\nMake you feel alright\nThey bring you back to life\nMad sounds, in your ears\nMake you get up and dance\nMake you get up\nYeah, they make you get up\nLove buckles under the strain\nOf those wild nights\nRun but you can not hide\n\nMad sounds, in your ears\nMake you get up and dance\nMake you get up\nAll night long they reappear\nMake you get up and dance\nYeah, they make you get up\n\nSuppose you've gotta do what you've gotta do\nWe just weren't feeling how we wanted to\nYou sit and try sometimes\nBut you just can’t figure out what went wrong\nThen out of nowhere, somebody comes and hits you with an\n\nOoh la la la, ooh la la la, ooh la la la, ooh\nOoh la la la, ooh la la la, ooh la la la, ooh\n\nYou got those mad sounds, in your ears\nTo make you get up and dance\nMad sounds, in your ears\nThey make you get up and dance\nHold on to make you dance\nAh yeah, they make you get up\n\nOoh la la la, ooh la la la, ooh la la la, ooh\nOoh la la la, ooh la la la, ooh la la la, ooh\nOoh la la la, ooh la la la, ooh la la la, ooh\nOoh la la la, ooh la la la, ooh la la la, ooh\nOoh la la la, ooh la la la, ooh la la la, ooh\nOoh la la la, ooh la la la, ooh la la la, ooh", 
    "title": "Mad Sounds"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-mardy-bum-lyrics", 
    "id": 84679, 
    "lyrics": "Well, now then, mardy bum\nI've seen your frown and it's like looking down\nThe barrel of a gun and it goes off\nAnd out come all these words\nOh, there's a very pleasant side to you\nA side I much prefer\n\nIt's one that laughs and jokes around\nRemember cuddles in the kitchen, yeah\nTo get things off the ground\nAnd it was; up, up, and away\nAh, but it's right hard to remember that\nOn a day like today\nWhen you're all argumentative\nAnd you've got the face on\n\nWell, now then mardy bum\nOh, I'm in trouble again, aren't I?\nI thought as much\n'Cause you turned over there\nPulling that silent disappointment face\nThe one that I can't bear\n\nWell, can't we just laugh and joke around?\nRemember cuddles in the kitchen, yeah\nTo get things off the ground\nAnd it was; up, up, and away\nAh, but it's right hard to remember that\nOn a day like today\nWhen you're all argumentative\nAnd you've got the face on\n\nAnd yeah, I'm sorry I was late\nBut I missed the train\nAnd then the traffic was a state\nAnd I can't be arsed to carry on in this debate\nThat reoccurs, oh, when you say I don't care\nBut, of course I do, yeah, I clearly do\n\n\nSo laugh and joke around\nRemember cuddles in the kitchen, yeah\nTo get things off the ground\nAnd it was; up, up, and away\nOh, but it's right hard to remember that\nOn a day like today\nWhen you're all argumentative\nAnd you've got the face on", 
    "title": "Mardy Bum"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-matador-lyrics", 
    "id": 330338, 
    "lyrics": "She was marrying a matador and he was with the weather girl\nA very clever girl who stood out amongst several ones\nA terrible dilemma and forever he'll regret the day\nHe didn't make the rescue from the bullring\nSulking won't get you nowhere, son\nThere's blood on your chin where you've bitten your tongue\nSmitten, but might not be smitten for long\nIf you're still sitting, she'll soon be smitten and gone", 
    "title": "Matador"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-my-propeller-lyrics", 
    "id": 96077, 
    "lyrics": "If you can summon the strength, tow me\nI can't hold down the urgency\nYou've got to make your descent slowly\nAnd oil up those sticky keys\n\nCoax me out my low\nAnd have a spin of my propeller\n\nIt's a necessary evil\nNo cause for emergency\nBorrowed the beak off a bald eagle\nOh, momentary synergy\n\nCoax me out my low\nSink into tomorrow\nCoax me out my low\nAnd have a spin of my propeller\n\nMy propeller won't spin\nAnd I can't get it started on my own\nWhen are you arriving?\nOh, my propeller won't spin\nAnd I can't get it started on my own\nWhen are you arriving?\nOh, my propeller won't spin\nAnd I can't get it started on my own\nWhen are you arriving?\nOh, my propeller", 
    "title": "My Propeller"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-nettles-lyrics", 
    "id": 129302, 
    "lyrics": "Sank into their calculations and snorted on a stench\nOf their arithmetic\nLook for the boy who was hanging his head low\nMore trophies and ideas to follow their pretend\n\nWith a scowl in his pocket and a smile on his face\nHe followed with obedience and fell in the nettles\n\nAfterwards those spiky whispers said he brought his own rope\nAnd skipped the bits they loathed\nDidn’t scramble to find a dock leaf and capture back our hope\nTo advice, his mind had closed\nHe lost all of his foot holes\n\nAnd with a scowl in his pocket and a smile on his face\nHe followed with obedience and fell in the nettles\nFell in the nettles, fell in the nettles\n\nHe was a toothpick and the garlic and the cinder upon the path\nHad failed to blunt or hinder the slow collapse\nAnd clinging to the door frame, he was trapped\nOff to a reminder of where he had been\n\nWith a smile in his pocket and a scowl on his face\nThere was nowhere to flee, so sat content in the nettles", 
    "title": "Nettles"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-no-1-party-anthem-lyrics", 
    "id": 213211, 
    "lyrics": "So you're on the prowl wondering whether\nShe left already or not\nLeather jacket, collar popped like antenna\nNever knowing when to stop\nSunglasses indoors, par for the course\nLights in the floors and sweat on the walls\nCages and poles\nCall off the search for your soul\nOr put it on hold again\nShe's having a sly indoor smoke\nAnd she calls the folks who run this, her oldest friends\nSipping a drink and laughing at imaginary jokes\nAs all the signals are sent, her eyes invite you to approach\nAnd it seems as though those lumps in your throat\nThat you just swallowed have got you going\n\nCome on, come on, come on\nCome on, come on, come on\nNumber one party anthem\n\nShe's a certified mind blower\nKnowing full well that I don't\nMay suggest there's somewhere from which I might know her\nJust to get the ball to roll\nDrunken monologues, confused because\nIt's not like I'm falling in love, I just want ya\nTo do me no good\nAnd you look like you could\n\nCome on, come on, come on\nCome on, come on, come on\nNumber one party anthem\nCome on, come on, come on\nBefore the moment's gone\nNumber one party anthem, yeah, yeah\n\nThe look of love, the rush of blood\nThe \"She's with me\"'s, the Gallic shrug\nThe shutterbugs, the Camera Plus\nThe black & white and the color dodge\nThe good time girls, the cubicles\nThe house of fun, the number one\nParty anthem, oh\n\nCome on, come on, come on\nCome on, come on, come on\nCome on, come on, come on\nCome on, come on, come on\nBefore the moment's gone\nNumber one party anthem\nNumber one party anthem\nNumber one party anthem\nYeah, yeah", 
    "title": "No. 1 Party Anthem"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-no-buses-lyrics", 
    "id": 105009, 
    "lyrics": "Lady, where has your love gone?\nI was looking but can't find it anywhere\nThey always offer when there's loads of love around\nBut when you're short of some, it's nowhere to be found\nWell, I know your game, you told him yesterday\n\"No chance, you'll get nothing from me\"\nBut now she's there, you're there and everybody's there\nHe's in turmoil, as puzzled as can be, just like me\n\nLet's go down, down, low down\nWhere I know I should not go\nOh, and she, you think she's the one\nBut she's just one in twenty-four\nAnd just 'cause everybody's doing it\nDoes that mean that I can too?\n\nLady, where has your love gone?\nIt was the antiseptic to the sore\nTo hold you by the hand\nMust you first be in demand?\nHow he longs for you to long for him once more\nJust once more\n\nLet's go down, down, low down\nWhere I know I should not go\nOh, and she, you think she's the one\nBut she's just one in twenty-four\nAnd just 'cause everybody's doing it\nDoes that mean that I can too?\n\nOh, her eyes went down and cut you up\nAnd there's nothing like a dirty look from\nThe one you want or the one you've lost\n\nAn ache in your soul, it's everybody's goal\nTo get what they can't have\nThat's why you're after her and that's why she's after him\nBut saying it won't change a thing\n\nAnd they'll realise that it won't change a thing\nRealise that it won't change a thing", 
    "title": "No Buses"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-old-yellow-bricks-lyrics", 
    "id": 93410, 
    "lyrics": "Old yellow bricks, love's a risk\nQuite the little escapologist\nLooked so miffed when you wished\nFor a thousand places better than this\nYou are the fugitive but you don't know what you're running from\nYou can't kid us and you couldn't trick anyone\nHoudini, love, you don't know what you're running away from\n\nWho wants to sleep in the city that never wakes up?\nBlinded by nostalgia\nWho wants to sleep in the city that never wakes up?\n\nShe was enraged by the way\nThat the emperor put traps in the cage\nAnd the days she'd been dull\nLead to nights reading beer bottles\nYou're such a fugitive but you don't know what you're running from\nYou can't kid us and you couldn't trick anyone\nHoudini, love, you don't know what you're running away from\n\nWho wants to sleep in the city that never wakes up?\nBlinded by nostalgia\nWho wants to sleep in the city that never wakes up?\n\nYou're at a loss just because\nIt wasn't all that you thought it was\nYou are the fugitive\nBut you don't know what you're running away from\nShe said, \"I want to sleep in the city that never wakes up\nAnd revel in nostalgia\"\nI know I said, \"Who wants to sleep in a city that never wakes up?\"\nBut Dorothy was right though", 
    "title": "Old Yellow Bricks"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-one-for-the-road-lyrics", 
    "id": 213174, 
    "lyrics": "One for the road, oooh oooh\nOne for the road, oooh oooh\n\nFrom the bottom of your heart\nThe relegation zone\nI saw this comin' from the start\nThe shake, rattle and roll\nThe cracks in blackout blinds\nCast patterns on the ceiling\nBut you're feeling fine\nI thought it was dark outside\nI thought it was dark outside\n\nOne for the road\nSo we all get back to yours\nAnd you sit and talk to me on the floor\nThere's no need to show me 'round, baby\nI feel like I've been here before\nI've been wonderin' whether later\nWhen you tell everybody to go\nWill you pour me one for the road?\n\nI knew this would be on the cards\nI knew you wouldn't fold\nI saw this comin' from the start\nThe shake, rattle and roll\n\nOne for the road\nSo we all get back to yours\nAnd you sit and talk to me on the floor\nThere's no need to show me 'round, baby\nI feel like I've been here before\nI've been wonderin' whether later\nWhen you tell everybody to go\nWill you pour me one for the road?\n\nThe mixture hits you hard\nDon't get that sinking feeling\nDon't fall apart\nSome out of tune guitar\nSoundtrack to disaster\nOooh oooh, one for the road\nOooh oooh, one for the road\nOooh oooh, one for the road\nOooh oooh, one for the road\n\nOooh oooh\nOooh oooh\nOooh oooh\nOooh oooh\n\nOne for the road\nSo we all get back to yours\nAnd you sit and talk to me on the floor\nThere's no need to show me 'round, baby\nI feel like I've been here before\nI've been wonderin' whether later\nWhen you tell everybody to go\nWill you pour me one for the road?", 
    "title": "One for the Road"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-one-point-perspective-lyrics", 
    "id": 3629324, 
    "lyrics": "Dancing in my underpants\nI'm gonna run for government\nI'm gonna form a covers band and all (stop)\nBack there by the baby grand, did Mr. Winter Wonderland say\n\"Come 'ere, kid, we really need to talk\"?\nBear with me, man, I lost my train of thought\n\nI fantasise, I call it quits, I swim with the economists\nAnd I get to the bottom of it for good\nBy the time reality hits, the chimes of freedom fell to bits\nThe shining city on the fritz\nThey come out of the cracks, thirsty for blood (stop)\n\nOh, just as the apocalypse finally gets prioritised\nAnd you cry some of the hottest tears you ever cried\nMultiplied by five\nI suppose a singer must die\n\n\"Singsong 'Round the Money Tree\"\nThis stunning documentary that no one else unfortunately saw\nSuch beautiful photography, it's worth it for the opening scene\nI've been driving 'round listening to the score\nOr maybe I just imagined it all\nI've played to quiet rooms like this before\nBear with me, man, I lost my train of thought", 
    "title": "One Point Perspective"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-only-ones-who-know-lyrics", 
    "id": 93921, 
    "lyrics": "In a foreign place, the saving grace was the feeling\nThat it was a heart that he was stealing\nOh, he was ready to impress and the fierce excitement\nThe eyes are bright, he couldn't wait to get away\nAnd I bet that Juliet was just the icing on the cake\nMake no mistake, no\n\nAnd even if somehow we could have\nShown you the place you wanted\nWell, I'm sure you could have\nMade it that bit better on your own\n\nAnd I bet she told a million people that she'd stay in touch\nWell, all the little promises, they don't mean much\nWhen there's memories to be made\nAnd I hope you're holding hands by New Year's Eve\nThey made it far too easy to believe\nThat true romance can't be achieved these days\n\nAnd even if somehow we could have\nShown you the place you wanted\nWell, I'm sure you could have\nMade it that bit better on your own\nYou are the only ones who know", 
    "title": "Only Ones Who Know"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-only-you-know-lyrics", 
    "id": 2923358, 
    "lyrics": "I want to see something that used to be in your eyes again\nI'm waiting to see it\nYou know it's only a question of when\nAnd I know how much I'm missing heaven\nYou know that its missing\nAnd only you know\nWhere you have been to\nOnly you know\nWhat you have been through\nThere's better things\nYou're gonna get into\nAnd I wanna be there too\nI know it's not easy for you to start to believe again\nAnd when the day comes, don't let yourself be deceived again\nCause I know, how you've been waiting\nSuch a long time, that you've been waiting\nAnd only you know\nWhere you have been to\nOnly you know\nWhat you have been through\nThere's better things\nYou're gonna get into\nAnd I wanna be there too\nAnd I know how you've been waiting\nSuch a long time that you've been waiting\nAnd only you know\nWhere you have been to\nOnly you know\nWhat you have been through\nThere's better things\nYou're gonna get into\nAnd I wanna be there too", 
    "title": "Only You Know"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-on-the-run-from-the-mi5-lyrics", 
    "id": 344029, 
    "lyrics": "Come and take a leaf out of my book\nI'm a crack dealing crook\nSelling lots of rock and roll to the masses\nAnd I know if you wanna take a trip to the city\nWe can go (to Gibraltar)\nWe can go (to Gibraltar)\n\nLet's go, let's go, let's go, come on\nCome on, come on, come on, come on\nLet's go, let's go, let's go, come on\nGive me your switch card\nI'll book some flights\n\n1996 and I'm stuck at the bottom of a truck\nOn the run from the MI5, got detectives\nAnd I'll say if you catch me that I really wish\nThat I had stayed (in Gibraltar)\nThat I had stayed (in Gibraltar)\n\nLet's go, let's go, let's go, come on\nCome on, come on, come on, come on\nLet's go, let's go, let's go, come on\nGive me your switch card\nI'll book some flights", 
    "title": "On the Run from the MI5"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-perhaps-vampires-is-a-bit-strong-but-lyrics", 
    "id": 92126, 
    "lyrics": "I've seen your eyes as they fix on me\nWhat is he doing? What on earth's the plan, has he got one?\nYou better give me some pointers\nSince you are the big rocket launcher and I'm just the shotgun\nI ain't got no dollar signs in my eyes\nThat might be a surprise but it's true, said, I'm not like you\nAnd I don't want your advice or your praise\nOr to move in the ways you do and I never will\n\n'Cause all you people are vampires\nAnd all your stories are stale\nAnd though you pretend to stand by us\nI know you're certain we'll fail\n\nI've seen your eyes as they fix on me, full of confusion\nYour snarl is just so condescending!\nTrying to explain that we're on to a win\nIf the fee we get in near recoups what we're spending\nHe said, \"I can't believe that you drove all that way\nWell how much did they pay ya? How much did they pay ya?\nYou'd have been better to stay round our way\"\nThinking about things but not actually doing the things\n\n'Cause all you people are vampires\nAnd all your stories are stale\nAnd though you pretend to stand by us\nI know you're certain we'll fail\n'Cause all you people are vampires\nAnd all your stories are stale\nAnd though you pretend to stand by us\nI know you're certain we'll fail\n\n\nAll you people are vampires!", 
    "title": "Perhaps Vampires Is a Bit Strong But..."
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-piledriver-waltz-lyrics", 
    "id": 51732, 
    "lyrics": "I etched the face of a stopwatch on the back of a raindrop\nAnd did a swap for the sand in an hourglass\nI heard an unhappy ending, it sort of sounds like you leaving\nI heard the piledriver waltz, it woke me up this morning\n\nYou look like you've been for breakfast at the heartbreak hotel\nAnd sat in the back booth by the pamphlets\nAnd the literature on how to lose\nYour waitress was miserable and so was your food\nIf you're gonna try and walk on water\nMake sure you wear your comfortable shoes\n\nMysteries flashing amber go green when you answer\nBut the red on the rest of the questionnaire never changes\nI heard the news that you're planning\nTo shoot me out of a cannon\nI heard the piledriver waltz, it woke me up this morning\n\nYou look like you've been for breakfast at the heartbreak hotel\nAnd sat in the back booth by the pamphlets\nAnd the literature on how to lose\nYour waitress was miserable and so was your food\nIf you're gonna try and walk on water\nMake sure you wear your comfortable shoes\n\nOh-oh, oh-oh\nPiledriver", 
    "title": "Piledriver Waltz"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-plastic-tramp-lyrics", 
    "id": 149407, 
    "lyrics": "He looks as if he hasn't slept\nHis hair is purposely unkept\nIn many doorways, people wept\nWhen you crafted your plan\nShadows underneath the eyes\nAnd everywhere the bastard lies\nMy lack of proof is your disguise\nYou won't remember me\n\nThere's nothing really I can say\nBut \"Sorry, mate\" and walk away\nI could be wrong on this, you play your game\nThis world is full of most unkind\nAnd horrible is redefined\nI can't imagine that you'd mind at all\n\nYou're lying again, your conscience isn't your friend\nAnd the only thing you're sobbing at is your imagination\nLying again, your conscience isn't your friend\nAnd the only thing you're sobbing at is your imagination\n\nIs he really on the street?\nDesperation or deceit?\nAnd what he's wearing on his feet\nWon't solve our mystery\nAnd I am baffled by how you stand there, soaking it in\nAnd do you hide your identity where you hide your grin?\nYou'd better hide your grin\n\nShadows underneath the eyes\nAnd everywhere the bastard lies\nMy lack of proof is your disguise\nYou won't remember me\n\nThere's nothing really I can say\nBut \"sorry, mate\" and walk away\nI could be wrong unless you play your game\nThis world is full of most unkind\nAnd horrible is redefined\nI can't imagine that you'd mind at all\n\nYou're lying again, your conscience isn't your friend\nAnd the only thing you're sobbing at is your imagination\nLying again, your conscience isn't your friend\nAnd the only thing you're sobbing at is your imagination", 
    "title": "Plastic Tramp"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-potion-approaching-lyrics", 
    "id": 116367, 
    "lyrics": "I was biting the time zone\nAnd we embellished the banks of our bloodstreams\nAnd threw caution to the colourful\nThen we fell asleep in the car\nUntil the bumps woke me up in your grip\nAnd the tide took me to your mouth\nAnd then swept me back down to your palms\nIt's them that put me inside the reminder\nThat yours is the only ocean\n\nYours is the only ocean\nThat I wanna swing from\nYours is the only ocean\nThat I wanna hang on\n\nI've got this ego mechanic\nShe's always trying to give me vitamins\nAh, she'd be frightened of your reflection\nI preferred her as a cartoon\nIf I could be someone else for a week\nI'd spend it chasing after you\n'Cause she's not shattering my attitudes\nNo matter how she folds the potion\nYours is the only ocean\n\nYours is the only ocean\nThat I wanna swing from\nYours is the only ocean\nThat I want to hang on\n\nPotion approaching, shield your eyes\nPotion approaching, visualise\nHolding a token, swollen in size\nPotion approaching, shield your eyes\n\nOh, but if we're gonna escape though\nWe really ought to think it through\nWould you like me to build you a go-kart?", 
    "title": "Potion Approaching"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-pretty-visitors-lyrics", 
    "id": 65948, 
    "lyrics": "Trudging through the morning\nThe tramp with the trampoline under his arm\nShifts past your whiskers, so stark is the charm\nBut the barking alarm waits coiled 'til the corner is turned\nAnd the bicycle wheels all struggle to move 'round\nIn your muddy mind, blatantly caked and\nUnwilling to wind uncooperative time\nSo he sits on the springs 'til the muck goes dry\n\nAll the pretty visitors came and waved their arms\nAnd cast the shadow of a snake pit on the wall\nAll the pretty visitors came and waved their arms\nAnd cast the shadow of a snake pit on the\n\nWhat came first, the chicken or the dickhead?\nSplit sleep reaps rewards from ill fitting thoughts\nAnd twilight forced you to go on a walk\nYour legs start running and your head gets caught\nCanopy 19 is perfectly placed\nFor the reasonably frightening fall from the aftertaste\nYou'll have to slip away, I am unhappy to say\nBehold as the crook in the hammock plays\n\nAll the pretty visitors came and waved their arms\nAnd cast the shadow of a snake pit on the wall\nAll the pretty visitors came and waved their arms\nAnd cast the shadow of a snake pit on the wall\n\nBehold there's a crook in the hammock plays\nCruelly with the base and the scales\nAnd fiddles with the feet on a balancing act\nGagged, bound and crafting a tale\nTrailing wrapped in a gasp\nCruelly with the base and the scales\nAnd fucking fiddles with the feet on a balancing act\nShe was gagged, bound and crafting a tale\nTrailing wrapped in a gasp\n\nAll the pretty visitors came and waved their arms\nAnd cast the shadow of a snake pit on the wall\nAll the pretty visitors came and waved their arms\nAnd cast the shadow of a snake pit on the wall", 
    "title": "Pretty Visitors"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-put-me-in-a-terror-pocket-lyrics", 
    "id": 3577019, 
    "lyrics": "He spoke a script\nDipped in the sort of talk to make you keep the gaze\nIt's all a trick\nThe slicked back slimy arms have got a war to wage\nHe's got a laugh like a crackling wire\nAnd he wants to put the bite marks on you\nHe wants to put the bite marks on you\nAnd he twists my guts\nAs the only thing that's repelling as his invitations\nAre his excuses\nAnd he said \"I am the conductor\nPut me in a terror pocket\"\nHe did a stint\nMaster in a craft\nHe'd squint through his spectacle\nHe'd drop a dirty hint if he thinks that he could impress you with the unacceptable\nAnd he has turned through all the pages with his fingers\nAnd covered them with goo\nAnd he wants to put the bite marks on you\nHe wants to put them on you and it hurts my back\nBecause the only thing that's as heavy as the adoration\nIs the days of hanging out on his lawn\nAnd he spilled without a sounding alarm\nAnd he frightened me to death\nWhen he said \"I am the conductor", 
    "title": "Put Me In A Terror Pocket"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-put-your-dukes-up-john-lyrics", 
    "id": 298778, 
    "lyrics": "Just put your dukes up, John\nYeah, put your dukes up, John\nYou were preened and sanitised\nStruck dumb by good advice\nYour integrity was bruised\nYour celebrity a ruse\nThey pulled the rug from under\nMade way for new pretenders\n\n(Change your tune and change your hair)\nPut your dukes up, John\n(Or you're not going anywhere)\nPut your dukes up, John\n(Change your tune and change your hair)\nPut your dukes up, John\n(Or you're not going anywhere)\nPut your dukes up, John\n\nAnd be a C-Y-N-I-C\nBe a C-Y-N-I-C\n\nThe profit margin blinds them\nThey groomed and ostracised him\nHis calm makes my blood boil\nHis calm makes my blood boil\n\n(Change your tune and change your hair)\nPut your dukes up, John\n(Or you're not going anywhere)\nPut your dukes up, John\n(Change your tune and change your hair)\nPut your dukes up, John\n(Or you're not going anywhere)\nPut your dukes up, John\n\nAnd be a C-Y-N-I-C\nBe a C-Y-N-I-C\n\n(Change your tune and change your hair\nOr you're not going anywhere\nChange your tune and change your hair\nOr you're not going anywhere)\nChange your tune and change your hair\nOr you're not going anywhere\nChange your tune and change your hair\nOr you're not going anywhere\n\n(Change your tune and change your hair)\nPut your dukes up, John\n(Or you're not going anywhere)\nPut your dukes up, John\n(Change your tune and change your hair)\nPut your dukes up, John\n(Or you're not going anywhere)\nPut your dukes up, John\n\n(Change your tune and change your hair)\nAnd be a C-Y-N-I-C\n(Or you're not going anywhere)\nAnd be a C-Y-N-I-C\n(Change your tune and change your hair)\nAnd be a C-Y-N-I-C\n(Or you're not going anywhere)\nAnd be a C-Y-N-I-C", 
    "title": "Put Your Dukes Up John"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-ravey-ravey-ravey-club-lyrics", 
    "id": 344022, 
    "lyrics": "She's been thinking, well fuck it all, we're not going home today\nAnd she's been eating too much magic beans to walk home anyway\nAnd you can't fool me, come down to the dirty ground\nPut up your picture and the playful word will get around\nYeah, word will get around, yeah\nYeah, word will get around\n\nEveryone's feeling alright\nI won't be sleeping today\nI won't be sleeping tonight\n\nFeeling silly, feeling oh so sick\nAnd I can't see you through the smoke because the cloud's so thick\nAnd there's a fire as you're dancing to the disco sound\nPut up your picture baby and word will get around\nYeah, word will get around, yeah\nYeah, word will get around\n\nEveryone's feeling alright\nI won't be sleeping today\nI won't be sleeping tonight", 
    "title": "Ravey Ravey Ravey Club"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-reckless-serenade-lyrics", 
    "id": 51726, 
    "lyrics": "Topless models doing Semaphore\nWave their flags as she walks by and get ignored\nIlluminations on a rainy day\nWhen she walks, her footsteps sing a reckless serenade\n\nI've been trying to figure out exactly what it is I need\nCalled up to listen to the voice of reason\nAnd got the answering machine\n\nThe type of kisses where teeth collide\nWhen she laughs, the heavens hum a stun gun lullaby\nThose twinkling vixens with the shining spiral eyes\nTheir hypnosis goes unnoticed when she's walking by\n\nI've been trying to figure out exactly what it is I need\nCalled up to listen to the voice of reason\nAnd got the answering machine\n\nI left my message but did he fuck get back to me\nAnd now I'm stuck still wondering how it's meant to be\n\nSinging a reckless serenade, reckless serenade\nReckless serenade, reckless serenade\nReckless serenade, reckless serenade\nReckless serenade", 
    "title": "Reckless Serenade"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-red-light-indicates-doors-are-secured-lyrics", 
    "id": 75369, 
    "lyrics": "We'll ask if we can have six in\nIf not we'll have to have two\nWell, you're coming up at our end aren't you?\nSo I'll get one with you\nWon't he let us have six in?\nEspecially not with the food\nHe could have just told us no, though\nHe didn't have to be rude\nYou see her with the green dress?\nShe talked to me at the bar\nWell how come it's already two-pound fifty?\nWe've only gone about a yard\nDidn't you see she were gorgeous?\nShe were beyond belief\nBut this lad at the side drinking his Smirnoff Ice\nCame and paid for her Tropical Reef\n\nAnd I'm sitting going backwards\nAnd I didn't want to leave\nI said \"It's High Green, mate\nVia Hillsborough, please\"\n\nWell, how funny were that sketch earlier\nUp near that taxi rank?\nOh no, you would have missed it\nThink it were when you went to the bank\nThese two lads squaring up proper shouting\n'Bout who were next in the queue\nThe kind of thing that'd seem so silly\nBut not when they've both had a few\nWell, calm down, temper, temper\nYou shouldn't get so annoyed\nWell, you're acting like a silly little boy\nOh, they wanted to be men\nAnd do some fighting in the street\nHe said \"No surrender\nNo chance of retreat\"\n\n\nAnd so why are they in the taxi?\n'Cause I didn't want to leave\nI said \"It's High Green, mate\nVia Hillsborough, please!\"\n\nDrunken plots hatched to jump it\nAsk around, \"Are you sure?\"\nWent for it but the red light was showing\nAnd red light indicates doors are secured", 
    "title": "Red Light Indicates Doors Are Secured"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-red-right-hand-lyrics", 
    "id": 193516, 
    "lyrics": "Take a little walk to the edge of town and go across the tracks\nWhere the viaduct looms like a bird of doom as it shifts and cracks\nWhere secrets lie in the border fires and the humming wires\nWell, you know you're never coming back\nPast the square, past the bridge, past the mills, past the stacks\n\nOn a gathering storm comes a tall handsome man\nIn a dusty black coat with a red right hand\n\nHe'll wrap you in his arms and tell ya that you've been a good boy\nHe'll rekindle all of those dreams it took you a lifetime to destroy\nHe'll reach deep into the hole, heal your shrinking soul\nAnd there won't be a single thing that you can do\nHe's a god, he's a man, he's a ghost, he's a guru\n\nThey're whispering his name 'cross this disappearing land\nBut hidden in his coat is a red right hand\n\nYou don't have no money? He'll get you some\nIf you haven't got no car, he'll get you one\nYou've got no self-respect, you feel like an insect\nWell, don't you worry, buddy, 'cause here he comes\nThrough the ghetto and the barrows\nAnd the Bowery and the slums\n\nA shadow is cast wherever he stands\nStacks of green paper in his red right hand\n\n\nYou'll see him in your nightmares, you'll see him in your dreams\nHe'll appear out of nowhere, but he's not what he seems\nYou'll see him in your head and on the TV screen\nHey, buddy, I'm warning you to turn it off\nHe's a ghost, he's a god, he's a man, he's a guru\n\nYou're one microscopic cog in his catastrophic plan\nDesigned and directed by his red right hand", 
    "title": "Red Right Hand"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-riot-van-lyrics", 
    "id": 84111, 
    "lyrics": "So up rolls a riot van\nAnd sparks excitement in the boys\nBut the policemen look annoyed\nPerhaps these are ones they should avoid\n\nGot a chase last night\nFrom men with truncheons dressed in hats\nWe didn't do that much wrong\nStill ran away though, for the laugh\nJust for the laugh\nAnd please just stop talking\n'Cause they won't find us if you do\nOh, those silly boys in blue\nWell, they won't catch me and you\n\n\"Have you been drinking, son?\nYou don't look old enough to me\"\n\"I'm sorry, officer\nIs there a certain age you're supposed to be?\n'Cause nobody told me\"\nAnd up rolls the riot van\nAnd these lads just wind the coppers up\nThey ask why they don't catch proper crooks\nThey get their address and their names took\nBut they couldn't care less\n\nThrown in the riot van\nAnd all the coppers kicked him in\nAnd there was no way he could win\nJust had to take it on the chin", 
    "title": "Riot Van"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-riot-van-demo-lyrics", 
    "id": 342564, 
    "lyrics": "We got thrown in a riot van\nAnd the coppers kicked him in\nAnd there was no way he could win\nJust had to take it on the chin\nSmoked a bong a last night\nAnd stole somebody's telephone\nHe thinks it's all alright\nBut they've left him on his own, on his own\nBut baby stop calling\nOver and over, yeah\nAnd give me some funny cigarettes\nAnd do what they told you, yeah\nPinched a car with one headlight\nAnd lost control, the passengers were screaming\nMade him shut his eyes real tight\nAnd think of you, and hope that he was dreaming\nThen up rolled the riot van\nAnd called the fire brigade\nBut it was already too late\nAnd there was no arrests to make\nOhhhhh!\nBut baby stop calling\nOver and over yeah\nAnd give me some funny cigarettes\nAnd do what they told you, yeah", 
    "title": "Riot Van (Demo)"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-r-u-mine-lyrics", 
    "id": 75913, 
    "lyrics": "I'm a puppet on a string\nTracy Island, time-traveling\nDiamond cutter-shaped heartaches\nCome to find you four in some velvet morning\nYears too late, she's a silver lining\nLone ranger riding through an open space\nIn my mind when she's not right there beside me\n\nI go crazy 'cause here isn't where I wanna be\nAnd satisfaction feels like a distant memory\nAnd I can't help myself, all I\nWanna hear her say is \"Are you mine?\"\nWell, are you mine?\nAre you mine?\nAre you mine? Woah, ah\n\nI guess what I'm trying to say is I need the deep end\nKeep imagining meeting, wished away entire lifetimes\nUnfair we're not somewhere misbehaving for days\nGreat escape, lost track of time and space\nShe's a silver lining climbing on my desire\n\nAnd I go crazy 'cause here isn't where I wanna be\nAnd satisfaction feels like a distant memory\nAnd I can't help myself, all I\nWanna hear her say is \"Are you mine?\"\nWell, are you mine? (Are you mine tomorrow?)\nAre you mine? (Or just mine tonight?)\nAre you mine? (Are you mine, mine?)\n\nAnd the thrill of the chase moves in mysterious ways\nSo in case, I'm mistaken, I\nJust wanna hear you say, \"You got me, baby\nAre you mine?\"\nShe's a silver lining\nLone ranger riding through an open space\nIn my mind when she's not right there beside me\n\nAnd I go crazy 'cause here isn't where I wanna be\nAnd satisfaction feels like a distant memory\nAnd I can't help myself, all I\nWanna hear her say is \"Are you mine?\"\nWell, are you mine? (Are you mine tomorrow?)\nAre you mine? (Or just mine tonight?)\nAre you mine? (Are you mine tomorrow?)\n(Or just mine tonight?)", 
    "title": "R U Mine?"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-sandtrap-lyrics", 
    "id": 344033, 
    "lyrics": "When you leave us through the patient doors\nThat rattle in your ear will be the sound of our applause\nRapturous, considered and due\nOh the nasty laughter and desperate smirks\nAre tangled in the boredom where out brittle kisses lurk\nWell how can I believe you, when you can't believe your luck\nAnd the shards of past attraction lie visible\nBut shy and blunt and weak and worn\nAway by whining in the emery paper voice you use to speak\nOh the shards of past attraction lie visible\nBut shy and blunt and weak and worn\nAway by whining in the emery paper voice you use to speak\nIn the trap\nYou only want to be the first to laugh\nYou only want to be the first in the sandtrap\nYou only want to be the first to laugh\nAnd your climbing holes and cinder claws\nRing out like the calenture that you sent us all towards\nFarewell, farewell, farewell", 
    "title": "Sandtrap"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-science-fiction-lyrics", 
    "id": 3629330, 
    "lyrics": "Religious iconography giving you the creeps?\nI feel rougher than a disco lizard tongue along your cheek\nThe rise of the machines\nI must admit you gave me something momentarily\nIn which I could believe\nBut the hand of harsh reality’s un-gloved\nAnd it’s on its way back in to scoop you up\nBut not on my watch\n\nI want to stay with you, my love\nThe way some science fiction does\n\nReflections in the silver screen of strange societies\nSwamp monster with a hard-on for connectivity\nThe ascension of the C.R.E.A.M\nMass panic on a not too distant future colony\nQuantitative easing\nI want to make a simple point about peace and love\nBut in a sexy way where it’s not obvious\nHighlight dangers and send out hidden messages\n\nThe way some science fiction does\nThe way some science fiction does\n\nGot the world on a wire\nIn my little mirror, mirror on the wall\nIn the pocket of my raincoat\nSo I tried to write a song to make you blush\nBut I’ve a feeling that the whole thing\nMay well just end up too clever for its own good\nThe way some science fiction does", 
    "title": "Science Fiction"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-scummy-lyrics", 
    "id": 1713113, 
    "lyrics": "So who's that girl there?\nI wonder what went wrong\nSo that she had to roam the streets\nShe don't do major credit cards\nI doubt she does receipts\nIt's all not quite legitimate\nAnd what a scummy man\nJust give him half a chance\nI bet he'll rob you if he can\nI can see it in his eyes, yeah\nThat he's got a driving ban\nAmongst some other offences\nAnd I've seen him with girls of the night\nAnd he told Roxanne to put on her red light\nThey're all infected but he'll be alright\nCause he's a scumbag, don't you know\nI said he's a scumbag, don't you know!\n\nAlthough you're trying not to listen\nI bet your eyes are staring at the ground\nShe makes a subtle proposition\nI'm sorry love I'll have to turn you down\nAnd oh he must be up to something\nWant half a chance to show he's more than likely\nI've got a feeling in my stomach\nI start to wonder what his story might be\nWhat his story might be\n\nThey said it changes when the sun goes down\nThey said it changes when the sun goes down\nThey said it changes when the sun goes down\nAround here\nAround\n\nAnd look here comes a Ford Mondeo\nIsn't he Mister Inconspicuous\nAnd he don't have to say 'owt\nShe's in the stance ready to get picked up\nAnd she's delighted when she sees him\nPulling in and giving her the eye\nBecause she must be fucking freezing\nScantily clad beneath the clear night sky\nShe don't stop in the winter, no and...\n\nThey said it changes when the sun goes down\nThey said it changes when the sun goes down\nThey said it changes when the sun goes down\nAround here\nThey said it changes when the sun goes down\nThey said it changes when the sun goes down\nThey said it changes when the sun goes down\nAround here\nAround here\n\nWhat a scummy man\nJust give him half a chance\nI bet he'll rob you if he can\nCan see it in his eyes that he's got a nasty plan\nI hope you're not involved at all", 
    "title": "Scummy"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-secret-door-lyrics", 
    "id": 96234, 
    "lyrics": "Fools on parade cavort and carry on for waiting eyes\nThat you would rather be beside than in front of\nBut she's never been the kind to be hollowed by the stares\n\nShe swam out of tonight's phantasm\nGrabbed my hand and made it very clear\nThere's absolutely nothing for us here\nIt's a magnolia celebration to be attended on a Wednesday night\nIt's better that than get a reputation as a miserable little tyke\nAt least that's the conclusion she came to in this overture\n\nAnd the secret door swings behind us\nShe's saying nothing, she's just giggling along\n\nHer arms were folded most indignant\nNot looking like she was soon to leave\nI had to squint in order to believe\nThen like a butler pushing on a bookshelf\nI'm unveiling the unexpected\nI, who was earlier reluctant\nWas suddenly embarrassed and corrected\nHow could such a creature survive in such a habitat?\n\nAnd the secret door swings behind us\nShe's saying nothing, she's just giggling along\nEven if they were to find us\nI wouldn't notice, I'm completely occupied\n\nAs all the fools on parade cavort and carry on for waiting eyes\nOnes you would rather be beside than in front of\nBut she's never been the kind to be hollowed by the stares\nFools on parade frolic and fuck about to make her gaze\nTurn to a scribble on a page by a picture that holds her absence\nBut you're daft to think she'd care\n\nFools on parade\nFools on parade\nFools on parade\nConduct a sing-along", 
    "title": "Secret Door"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-settle-for-a-draw-lyrics", 
    "id": 153142, 
    "lyrics": "Well, I watch you tangle every weekend\nIt might start different but it ends up the same\nOne minute, you're casually speaking\nThe next it all goes up and you pour fuel on the flame\nWith your jerrycan of words and tones\n\nAnd no one's gonna start a revolution\nSo we best leave it well alone\nAnd there's something that Frankie used to say\nApparently\n\nOh, he said, settle for the draw\nWell, you're not gonna get no more\nSo you should settle for a draw\nI told you once I'm sure, I told you once I'm sure\nYou should settle for a draw\nWhy don't you settle for a draw?\n\nWell, you're right, it is one set of rules for her\nAnd then another set for you\nBut that's just the way it is, I suppose\nAnd there's nowt you can do\nAnd let's not fall in the trap of answering back\nI am just a beginner but she'll be the only winner\nThat's for sure, so take the draw, if it's available\nAnd if it sets on fire\nDon't get out your jerrycan of words and... tones\n\n\nAnd no one's gonna start a revolution\nSo we best leave it well alone\nAnd there's something that Frankie used to say\nApparently\n\nOh, he said, settle for the draw\nWell, you're not gonna get no more\nSo you should settle for the draw\nI told you once I'm sure, I told you once I'm sure\nYou should settle for the draw\nWhy don't you settle for the draw?", 
    "title": "Settle for a Draw"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-she-looks-like-fun-lyrics", 
    "id": 3629331, 
    "lyrics": "One, two, three, four\n\n(She looks like fun)\n(She looks like fun)\n(She looks like fun)\n(She looks like)\n\nSmile like you've got a straw in something tropical\nI've got the party plugged right into my skull\nWayne Manor, what a memorable NYE\n\n(She looks like fun) Good morning\n(She looks like fun) Cheeseburger\n(She looks like fun) Snowboarding\n(She looks like)\n\nFinally, I can share with you through cloudy skies\nEvery whimsical thought that enters my mind\nThere's no limit to the length of the dickheads we can be\n\n(She looks like fun) Bukowski\n(She looks like fun) Dogsitting\n(She looks like fun) Screwballing\n(She looks like)\n\nFinally, there's a place where you can wag your tongue\nBaby, but why can't we all just get along?\nDance as if somebody's watching, 'cause they are\n\nNo one's on the streets\nWe moved it all online as of March\nI'm so full of shite\nI need to spend less time stood around in bars\nWaffling on to strangers all about martial arts\nAnd how much I respect them\n\n(She looks like fun) Key changes\n(She looks like fun) Re-thinking\n(She looks like fun) New order\n(She looks like fun)", 
    "title": "She Looks Like Fun"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-shes-thunderstorms-lyrics", 
    "id": 51727, 
    "lyrics": "She's thunderstorms\nLying on her front, up against the wall\nShe's thunderstorms\n\nI've been feeling foolish, you should try it\nShe came and substituted the peace and quiet for\nAcrobatic blood flow concertina\nCheating heart beat, rapid fire\n\nShe's thunderstorms\nLying on her front, up against the wall\nShe's thunderstorms\nHere is your host, sounds as if she's pretty close\nWhen the heat starts growing horns\nShe's thunderstorms\n\nShe's been loop-the-looping around my mind\nHer motorcycle boots give me this kind of\nAcrobatic blood concertina\nCheating heart beat, rapid fire\n\nShe's thunderstorms\nLying on her front, up against the wall\nShe's thunderstorms\n\nIn an unusual place, when you're feeling far away\nShe does what the night does to the day\n\nShe's thunderstorms\nLying on her front, up against the wall\nShe's thunderstorms, thunderstorms, thunderstorms", 
    "title": "She's Thunderstorms"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-sketchead-lyrics", 
    "id": 129776, 
    "lyrics": "Sketchead, he's coming to your party\nHe's walking up your drive and he's swinging all his keys 'round\nSketchead, he's seen you with your top off\nHe already knows your boyfriend, retain your introductions\nSketchead, that cumbersome protagonist\nThe pips in your quince, the eye behind the spy hole\nThe itch you can't itch in your ear\nAnd the knock that shattered your packet of peppermints\n\nSketchead, there's poison in his spit\nHe'll compliment your tits and leave you to your wits\nSketchead, convincingly insisting the tyres were bald\nWhen you gave him the car\nSketchead, still coming to your party\nStill walking up your drive and still swinging all his keys 'round\nOn his finger as a pendulum to unnerve\n\nAnd then there's you, you've changed\nI approach you like you were the same\nBut soon it was apparent a new name was required\nNew lips went and fired accomplishments at me\nWhile I'm captivated by your magazine skin\nThe tint on your lens is obscured to begin\nAnd you know full well\nThat anyone who says that they don't prefer the sequel\nWill still be swinging on themselves tonight", 
    "title": "Sketchead"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-snap-out-of-it-lyrics", 
    "id": 213235, 
    "lyrics": "What's been happenin' in your world?\nWhat have you been up to?\nI heard that you fell in love or near enough\nI gotta tell you the truth, yeah\n\nI wanna grab both your shoulders and shake, baby\nSnap out of it (Snap out of it)\nI get the feelin' I left it too late, but, baby\nSnap out of it (Snap out of it)\nIf that watch don't continue to swing\nOr the fat lady fancies havin' a sing\nI'll be here, waitin' ever so patiently for you to\nSnap out of it\n\nForever isn't for everyone\nIs forever for you?\nIt sounds like settlin' down or givin' up\nBut it don't sound much like you, girl\n\nI wanna grab both your shoulders and shake, baby\nSnap out of it (Snap out of it)\nI get the feelin' I left it too late, but, baby\nSnap out of it (Snap out of it)\nIf that watch don't continue to swing\nOr the fat lady fancies havin' a sing\nI'll be here, waitin' ever so patiently for you to\nSnap out of it\n\nUnder a spell, you're hypnotised (Ooh)\nDarling, how could you be so blind? (Snap out of it)\nUnder a spell, you're hypnotised (Ooh)\nDarling, how could you be so blind?\n\nI wanna grab both your shoulders and shake, baby\nSnap out of it (Snap out of it)\nI get the feelin' I left it too late, but, baby\nSnap out of it (Snap out of it)\nIf that watch don't continue to swing\nOr the fat lady fancies havin' a sing\nI'll be here, waitin' ever so patiently for you to\nSnap out of it", 
    "title": "Snap Out of It"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-space-invaders-lyrics", 
    "id": 344027, 
    "lyrics": "Space invaders flying home\nAnd they're going to hit the sack\nAnd they're probably going to die getting high\nCause they're mixing crazy moments with the crack\nAnd she's kissing all the boys\nShe's to clever to be slack\nBut she's bound to go away for a day\nAnd she'll like it, so she won't be coming back\n\nBaby, baby, baby\nYour good old days have died\nBaby, baby, baby\nNow won't you dry your pretty eyes\nBaby, baby, baby\nYour good old days are dead\nCome on\n\nSpot big bell bottom cords\nAnd a matching with a hat\nAnd you're a rule breaker, baby\nCan't you see me standing only in your way to hit the sack\nAnd she's kissing all the boys\nShe's too clever to be slack\nBut she's bound to go away for a day\nAnd she'll like it, so she won't be coming back\n\nBaby, baby, baby\nYour good old days have died\nBaby, baby, baby\nWon't you dry your pretty eyes\nBaby, baby, baby\nYour good old days are dead\nCome on", 
    "title": "Space Invaders"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-star-treatment-lyrics", 
    "id": 3483397, 
    "lyrics": "I just wanted to be one of The Strokes\nNow look at the mess you made me make\nHitchhiking with a monogrammed suitcase\nMiles away from any half-useful imaginary highway\nI'm a big name in deep space, ask your mates\nBut golden boy's in bad shape\nI found out the hard way that\nHere ain't no place for dolls like you and me\nEverybody's on a barge\nFloating down the endless stream of great TV\n1984, 2019\n\nMaybe I was a little too wild in the '70s\nRocket-ship grease down the cracks of my knuckles\nKarate bandana, warp speed chic\nHair down to there, impressive moustache\nLove came in a bottle with a twist-off cap\nLet's all have a swig and do a hot lap\n\nSo who you gonna call?\nThe Martini Police\nBaby, that isn't how they look tonight, oh no\nIt took the light forever to get to your eyes\n\nI just wanted to be one of those ghosts\nYou thought that you could forget\nAnd then I haunt you via the rear view mirror\nOn a long drive from the back seat\nBut it's alright, 'cause you love me\nAnd you recognise that it ain't how it should be\nYour eyes are heavy and the weather's getting ugly\nSo pull over, I know the place\nDon't you know an apparition is a cheap date?\nWhat exactly is it you've been drinking these days?\nJukebox in the corner, Long Hot Summer\nThey've got a film up on the wall and it's dark enough to dance\nWhat do you mean you've never seen Blade Runner?\n\nOh, maybe I was a little too wild in the '70s\nBack down to earth with a lounge singer shimmer\nElevator down to my make-believe residency\nFrom the honeymoon suite\nTwo shows a day, four nights a week\nEasy money\n\nSo who you gonna call?\nThe Martini Police\nSo who you gonna call?\nThe Martini Police\nOh, baby, that isn't how they look tonight\nIt took the light absolutely forever to get to your eyes\n\nAnd as we gaze skyward, ain't it dark early?\nIt's the star treatment\nYeah, and as we gaze skyward, ain't it dark early?\nIt's the star treatment\nIt's the star treatment\nThe star treatment", 
    "title": "Star Treatment"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-stickin-to-the-floor-lyrics", 
    "id": 267993, 
    "lyrics": "Won't somebody let me out?\nDon't want to stick around no more\nI'm sick of lookin' at you strange\nI'm sick of stickin' to the floor\n\nNot one of you has got an ounce of style in ya\nSaid, not one of you, no\n\nWell, fuck it all and break your nose\nIf they keep on pushin' you around\nIf they keep on steppin' on your toes\nAnd pick you up when you fall down\n\nNot one of you has got an ounce of style in ya\nSaid, not one of you, no\n\n\nNot one of you has got an ounce of style in ya, no\nSaid, not one of you, no", 
    "title": "Stickin' to the Floor"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-still-take-you-home-lyrics", 
    "id": 84109, 
    "lyrics": "Well, it's ever so funny\n'Cause I don't think you're special, I don't think you're cool\nYou're just probably alright\nBut under these lights you look beautiful\nAnd I'm struggling, I can't see through your fake tan\nYeah, and you know it for a fact that everybody's eating out of your hands\n\nBut what do you know?\nOh, you know nothing\nYeah, but I'll still take you home\nOh, yeah, I'll still take you home\nSo what do you know?\nSaid, you don't know nothing\n\nWell, fancy seeing you in here\nYou're all tarted up and you don't look the same\nWell, I haven't seen you since last year\nYeah, and surprisingly you have forgotten my name\nBut you know it, yeah, and you knew it all along\nOh and you say you have forgotten but you're fibbing, go on, tell me I'm wrong\n\nSo what do you know?\nOh, you know nothing\nYeah, but I'll still take you home\nOh, yeah, I'll still take you home\nSo what do you know?\nOh, you don't know nothing, no\n\nOh-woah, woah, woah\nOh-woah, woah, woah\nDa-da, da-da-da, da-da, da-da\nDa-da, da-da, da-da-da\nOh-woah, woah, woah\n\nOh, so what do you know?\nYeah, you don't know nothing, no\nYeah, but I'd still take you home\nOh, yeah, I'll still take you home\nI said, what do you know?\nOh, you don't know nothing\n\nI fancy you with a passion\nOh, you're a Topshop princess, a rockstar too\nBut you're a fad and you're a fashion\nAnd I'm having a job trying to talk to you\nBut it's alright, yeah, I'll put it on one side\nOh, 'cause everybody's looking, you've got control of everyone's eyes including mine", 
    "title": "Still Take You Home"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-stop-the-world-i-wanna-get-off-with-you-lyrics", 
    "id": 212392, 
    "lyrics": "Open Sesame (We've places to go)\nWe've people to see (Let's put 'em on hold)\nThere's all sorts of shapes that I bet you can make\nWhen you want to escape, say the word\n\nWell, I know that getting you alone isn't easy to do\nWith the exception of you, I dislike everyone in the room\nAnd I don't wanna lie, but I don't wanna tell you the truth\nGet the sense that you're on the move\nAnd you'll probably be leaving soon, so I'm telling you\n\nStop the world 'cause I wanna\nGet off with you\nStop the world 'cause I wanna\nGet off with you\n\nEyes the colour of (Water left in mud)\nIcing sugar dust (Crazy green flashes)\nIt's a funny thing that I cannot explain\nDon't you know the train keeps a-rolling?\n\nStop the world 'cause I wanna\nGet off with you\nStop the world 'cause I wanna\nGet off with you\n\n\nWell, I know that getting you alone isn't easy to do\nAnd I don't wanna lie, and I don't wanna tell you the truth\nAnd I know we got places to go, we got people to see\nThink we both oughta put 'em on hold and I know you agree\n\nStop the world 'cause I wanna\nGet off with you\nStop the world 'cause I wanna\nGet off with you", 
    "title": "Stop the World I Wanna Get Off With You"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-strange-lyrics", 
    "id": 2923393, 
    "lyrics": "Strange, how you stopped loving me\nHow you stopped needing me\nWhen he came along\nOh, how strange\nStrange, you changed like night and day\nJust up and walked away\nWhen he came along\nOh, how strange\nWell, I guess that I was just your puppet\nYou held on a string\nTo think I thought you really loved me\nBut look what thoughts can bring\nStrange, you're still in all my dreams\nOh such a funny thing\nI still care for you\nOh, how strange\nWell, I guess that I was just your puppet\nYou held on a string\nTo think I thought you really loved me\nBut look what thoughts can bring\nStrange, how you stopped loving me\nHow you stopped needing me\nWhen he came along\nOh, how strange", 
    "title": "Strange"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-suck-it-and-see-lyrics", 
    "id": 51728, 
    "lyrics": "Your love is like a studded leather headlock\nYour kiss, it could put creases in the rain\nYou're rarer than a can of dandelion and burdock\nAnd those other girls are just post-mix lemonade\n\nSuck it and see, you never know\nSit next to me before I go\nJigsaw women with horror movie shoes\nBe cruel to me 'cause I am a fool for you\n\nI poured my aching heart into a pop song\nI couldn't get the hang of poetry\nThat's not a skirt, girl, that's a sawn-off shotgun\nAnd I can only hope you've got it aimed at me\n\nSuck it and see, you never know\nSit next to me before I go\nJigsaw women with horror movie shoes\nBe cruel to me 'cause I am a fool for\n\nBlue moon girls from once upon a Shangri-La\nHow I often wonder where you are\nYou have got that face that just says\n\"Baby, I was made to break your heart\", oh-oh-oh\n\nSuck it and see, you never know\nSit next to me before I go, go, go, go\nJigsaw women with horror movie shoes\nBe cruel to me 'cause I am a fool for you", 
    "title": "Suck It and See"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-teddy-picker-lyrics", 
    "id": 93904, 
    "lyrics": "They've sped up to the point where they provoke\nThe punchline before they have told the joke\nPlenty of desperation to be seen\nStaring at the television screen\nThey've sped up to the point where they provoke\nYou to tell the fucking punchline before you have told the joke\nWell sorry, sunshine, it doesn't exist\nIt wasn't in the Top 100 list\n\nAnd it's the thousandth time that it's even bolder\nDon't be surprised when you get bent over\nThey told you, but you were dying for it\n\nShe saw it and she grabbed it and it wasn't what it seemed\nThe kids all dream of making it, whatever that means\nAnother variation on a theme\nA tangle on the television and the magazine\nD'you reckon that they do it for a joke?\nD'you reckon that they make 'em take an oath\nThat says that \"We are defenders of any poser\nOr professional pretender around\"\n\nAnd when did your list replace the twist and turn\nLike a fist replaced a kiss?\nDon't concern us with your bollocks, I don't want your prayer\nSave it for the morning after\n\n\nAnd it's the thousandth time that it's even bolder\nDon't be surprised when you get bent over\nThey told you, but you were gagging for it\n\nLet's have a game on the teddy picker\nNot quick enough, can I have it quicker?\nAlready thick and you're getting thicker\nLet's have a game on the teddy picker\nNot quick enough, can I have it quicker?\nAlready thick and you're getting thicker\n\nPresuming that all things are equal\nWho'd want to be men of the people\nWhen there's people like you?", 
    "title": "Teddy Picker"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-temptation-greets-you-like-your-naughty-friend-lyrics", 
    "id": 106783, 
    "lyrics": "I don't ever want to hate you\nSo don't show me your bed\nThe only roads are cul-de-sacs\nThe first thing that she said\n\nTemptation greets you like your naughty mate\nThe one that used to get you in bother\nBut one you could never bring yourself to hate\nAnd she said we've got that spark\nBut only lights a fuse, helps you see in the dark\nBut it's a sight you'll lose when\nThe temptation greets you like your naughty friend\n\nI don't ever want to hate you\nSo don't show me your bed\nThe only roads are cul-de-sacs\nThe only ends are dead\n\nTemptation greets you like your naughty mate\nThe one that made you steal and set things on fire\nThe one you haven't seen of late\nAnd I said that kind of talk\nOnly adds intrigue to the cauldron of thought\nIt's already exceeding\nTemptation, the very thing that held her back\n\nI don't ever want to hate you\nSo don't show me your bed\nThe only roads are cul-de-sacs\nThe only ends are dead\nI don't ever want to hate you\nIt's not part of the plan\nSo keep your charm where I can't see it\nAnd your hands where I can\n\nYo, it's Rasc' gettin' dirtee stankin', yeah\nWe used to be in tight, me and my naughty friends\nCaused pure madness in the end, I mean day and night\nWe robbed, we stole, we loved to fight\nSmoking, drinking, drag riding\nDrugs, thugs, not law-abiding\nReckless youngsters, no direction, no sign of correction\nBut then I switched it off, changed my ways\nRun the area like, \"Oh, my days\"\nBut a lot of my naughty friends, they're not phased\nCan't believe that this music pays\nSee no reason why we can't do\nAll the things that we've always done\nStill in my heart I know that's just one\nBut it's hard to fight the temptation, son\n\nThe panic will fall down around you\nIf you don't do what I say\n\nI don't ever want to hate you\nSo don't show me your bed\nThe only roads are cul-de-sacs\nThe only ends are dead\nI don't ever want to hate you\nIt's not part of the plan\nSo keep your charm where I can't see it\nAnd your hands where I can", 
    "title": "Temptation Greets You Like Your Naughty Friend"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-thats-where-youre-wrong-lyrics", 
    "id": 73003, 
    "lyrics": "A pussyfooting setting sun\nMake a wish that weighs a tonne\nThere are no handles for you to hold\nAnd no understanding where it goes\n\nJealousy in technicolor\nFear by name, love by numbers\nStreet lamp amber, wanderlust\nPowder in a blunderbuss\n\nShe looks as if she's blowing a kiss at me\nAnd suddenly the sky is a-sizzle\nSitting on the floor with a tambourine\nCrushing up a bundle of love\nDon't take it so personally\nYou're not the only one\nThat time has got it in for, honey\nThat's where you're wrong\n\nAll the old flames fastened on\nMake a wish that weighs a tonne\nThere are no handles you can hold\nAnd no understanding where it goes\n\nShe looks as if she's blowing a kiss at me\nAnd suddenly the sky is a-sizzle\nSitting on the floor with a tambourine\nCrushing up a bundle of love\nDon't take it so personally\nYou're not the only one\nThat time has got it in for, honey\nThat's where you're wrong\n\nThat's where you're wrong\nThat's where you're wrong\nOh, oh-oh, oh-oh, oh\nOh, oh-oh, oh-oh, oh-oh, oh-oh", 
    "title": "That's Where You're Wrong"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-afternoons-hat-lyrics", 
    "id": 136917, 
    "lyrics": "Made me kiss ya with a whisper\nAnd violently you swung through unfamiliar tongue\nCouldn't listen to tradition\nGrab me by the wrist to silently insist\n\nAnd when I'm in the confines of crawling walls\nYou hold me in place\nThe ripples on the ceiling, the avenues\nUnsugared taste\nWe'll waste away the evening\nThe afternoon and the afternoon's hat\nTogether we'll find something to direct some laughter at\n\nYou stood shirtless and confident\nListening to the fools, tickling the rules\nTheir obsessions followed patterns\nSat upon their stools with their attitudes\n\nAnd when I'm in the confines of crawling walls\nYou hold me in place\nThe ripples on the ceiling, the avenues\nUnsugared taste\nWe'll waste away the evening\nThe afternoon and the afternoon's hat\nTogether we'll find something to direct some laughter at\n\n\nAnd when I'm in the confines of crawling walls\nYou hold me in place\nThe ripples on the ceiling, the avenues\nUnsugared taste\nWe'll waste away the evening\nThe afternoon and the afternoon's hat\nTogether we'll find something to direct some laughter at", 
    "title": "The Afternoon's Hat"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-bad-thing-lyrics", 
    "id": 93911, 
    "lyrics": "Do the bad thing\nTake off your wedding ring\nBut it won't make it that much easier\nIt might make it worse\n\nOh, the night's like a whirlwind\nSomebody's girlfriend's talking to me, but it's alright\nShe's saying that he's not gonna slap me or try to attack me\nHe's not the jealous type\nAnd I only need to get half an excuse and I'm away\nBut when there's no excuses, that's much easier to say\nI've been before\nAnd all these capers make us to look for it to ignore\nSee, she's talking but I'm not entirely sure\n\nDo the bad thing\nTake off your wedding ring\nBut it won't make it that much easier\nIt might make it worse\n\nOh, a sudden disheartener\nSomebody's partner's talking to me\nBut I don't know that is what she isn't\nShe murmurs things to confirm that the tragedy is true\nAnd I knew, how could she not? She could have anyone she wants\nAnd I'm struggling to think of an immediate response\nLike, \"I don't mind, it'd be a big mistake for you to wait\nAnd let me waste your time\nReally, love, it's fine\"\nI said, \"Really, love, it's fine\"\n\n\nAnd then the first time it occurred that there was something to destroy\nI knew before the invitation that there was this ploy\nOh, but she carried on suggesting, a struggle to refuse\nShe said, \"It's the red wine this time,\" but that is no excuse", 
    "title": "The Bad Thing"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-bad-thing-2-lyrics", 
    "id": 3388035, 
    "lyrics": "Do the bad thing\nTake off your wedding ring\nOh it won’t make it that much easier\nIt might make it worse\nOh the nights like a whirlwind somebodies girlfriend\nTalking to me, but it’s alright she’s saying that he’s not gonna\nSlap me or try to attack me, he’s not the jealous type\nAnd I only need to get half an excuse and I’m away\nBut when there’s no excuses that’s much easier to say:\nI’ve been before\nAnd all these capers make us too good for her to ignore\nSee she’s talking but i’m not entirely sure, ah\nDo the bad thing\nAka off your wedding ring\nOh it won’t make it that much easier\nIt might make it worse\nOh a sudden disheartener somebodies partner’s talking to me\nBut i don’t know that is what she is\nThen she murmurs things to confirm that the tragedy is true\nAnd I knew how could she not, she could have anyone she wants\nAnd I’m struggling to think of an immediate response\nLike “I don’t min, it’d be a big mistake, for you to wait\nAnd have me waste your time, really love it’s fine”\nI said “really love it’s fine”\nAnd then the first time it occurred that there was something to destroy\nI knew before the invitation that there was this boy\nOh but she carried on suggesting, I struggled to refuse\nShe said its the red wine this time but that is no excuse", 
    "title": "The Bad Thing_2"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-bakery-lyrics", 
    "id": 128727, 
    "lyrics": "I wish you would have smiled in the bakery\nOr sat on a tatty settee\nAt some mutual friend's gathering\nAnd the more you keep on looking, the more it's hard to take\nLove, we're in stalemate\nTo never meet is surely where we're bound\nThere's one in every town\nJust there to grind you down\n\nI wish I would have seen you in the post office\nWell, maybe I did and I missed it\nToo busy with the mind on clever lines\nWhy not the rounders pitch or the canteen?\nYou're slacking, love, where have you been?\nJust had to go and wait until tonight\n\nTo give me the invite\nDon't worry, it's alright\n\nI wish I would have seen you down in the arcade\nSipping on a lemonade\nIn the paper cup and chewing on the straw\nAnd I wish I'd seen you in the bakery\nBut if I'd seen you in the bakery\nYou probably wouldn't have seen me", 
    "title": "The Bakery"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-blond-o-sonic-shimmer-trap-lyrics", 
    "id": 73004, 
    "lyrics": "Black as a beacon in a river of shimmering fog\nYes, she was\nIf you were heatseeking, she was hard to ignore\nYes, she was\n\nAnd she snapped wing mirrors off of Cadillacs\nThe particular pretty ones\nAnd that meant she never had to strain her back\nWhen she was putting her lippy on\n\nWell, time tastes bland when she's not around\nAnd you'd sit and you'd sink and approach the brink\nBefore she showed you how to shake love's steady hand\nTha knows\n\nAnd she snapped wing mirrors off of Cadillacs\nThe particular pretty ones\nAnd that meant she never had to strain her back\nWhen she was putting her lippy on\n\nShake love's steady hand\nShake love's steady\nShe floats like a niccy rush and stings like a B-flat\nThe blond-o-sonic shimmer trap\n\nAnd she snapped wing mirrors off of Cadillacs\nThe particular pretty ones\nAnd that meant she never had to strain her back\nWhen she was putting her lippy on", 
    "title": "The Blond-O-Sonic Shimmer Trap"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-death-ramps-lyrics", 
    "id": 2245543, 
    "lyrics": "", 
    "title": "The Death Ramps"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-hellcat-spangled-shalalala-lyrics", 
    "id": 51730, 
    "lyrics": "Just when things are getting complicated in the eye of the storm\nShe flicks a red-hot revelation off the tip of her tongue\nIt does a dozen somersaults and leaves you supercharged\nMakes me wanna blow the candles out\nJust to see if you glow in the dark\n\nShalalala, shalalala\nShalalala, shalalala\n\nHome sweet home, home sweet home, home sweet booby-trap\nI took the batteries out my mysticism\nAnd put 'em in my thinking cap\nShe's got a telescopic hallelujah hanging up on her wall\nFor when it gets too complicated in the eye of the storm\n\nShalalala, shalalala\nShalalala, shalalala\nOh, oh-oh-oh\n\nAnd in a hellcat spangled cavern\nWhen your judgement's on the run\nAnd you're acting like a stranger\n'Cause you thought it looked like fun\nAnd did you ever get the feeling\nThat these are things she's said before?\nHer steady hands may well have done the devil's pedicure\nWhat you waiting for? Sing another fucking shalalala\n\nShalalala, shalalala\nShalalala", 
    "title": "The Hellcat Spangled Shalalala"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-jam-of-boston-lyrics", 
    "id": 3951175, 
    "lyrics": "", 
    "title": "The Jam of Boston"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-jewellers-hands-lyrics", 
    "id": 116371, 
    "lyrics": "Fiendish wonder in a carnival's wake\nDull caresses once again irritate\nTread softly, stranger\nMove over toward the danger that you seek\nYou think excitement has receded then the mirror distracts\nThe logic of the trance quickly reaches and grasps\nHandsome and faceless\nAnd weightless, your imagination runs\n\nAnd now it's no one's fault but yours\nAt the foot of the house of cards\nYou thought you'd never get obsessed\nYou thought the wolves would be impressed\nAnd you're a sinking stone\nBut you know what it's like to hold the jeweller's hands\nThat procession of pioneers all drowned\n\nIn the moonlight they're more thrilling, those things that he knows\nAs he leads you through the grinning bubble blowers in the snow\nWatching his exit\nWas like falling off the ferry in the night\nThe inevitables gather to push you around\nAny other voice makes such a punishing sound\nHe became laughter's assassin\nShortly after he showed you what it was\n\nAnd now it's no one's fault but yours\nAt the foot of the house of cards\nYou thought you'd never get obsessed\nYou thought the wolves would be impressed\nAnd you're a sinking stone\nBut you know what it's like to hold the jeweller's hands\nThat procession of pioneers all drowned\n\nIf you've a lesson to teach me\nI'm listening, ready to learn\nThere's no one here to police me\nI'm sinking in until you return\nIf you've a lesson to teach me\nDon't deviate, don't be afraid\nWithout the last corner piece, I can't calibrate\nLet's get it ingrained\nIf you've a lesson to teach me\nI'm listening, ready to learn\nThere's no one here to police me\nI'm sinking in until you return\nIf you've a lesson to teach me\nDon't deviate, don't be afraid\nWithout the last corner piece, I can't calibrate\nLet's get it ingrained\nIf you've a lesson to teach me\nI'm listening, ready to learn\nThere's no one here to police me\nI'm sinking in until you return\nIf you've a lesson to teach me\nDon't deviate, don't be afraid", 
    "title": "The Jeweller's Hands"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-lovers-lyrics", 
    "id": 2923396, 
    "lyrics": "Up from the pastures of boredom\nOut from the sea of discontent\nThey come in packs like hungry hounds\nUp seekers of the dark enchantment\nThey haunt the boulevards and bars\nThey pray to wishing wells and stars\nThey ride the hurricane of hope\nNot looking back, but on they go\nToward the distance and deceiving\nAnd all the while they keep believing\nThey are special and apart\nThe lovers, the lovers of the heart... the lovers\nAnd when they pair off two by two\nThey feel they are the chosen few\nAnd though their beds are made of straw\nThey feel like velvet in the night\nAnd so the night is never ending\nIts made of distance and pretending\nCoz they're special and apart\nThe lovers, the lovers of the heart... the lovers\nAnd when love goes away\nAnd when love goes...\nGoodbye...\nCatches in their throats like cotton\nRises in their hearts like rain\nThe good times suddenly are all forgotten\nThe hunt begins again\nThey search the subways and the streets\nTheir faces tired, like their feet\nTheir bodies aching to be warm\nAnd so they hide behind the moon\nTheir loneliness inside them growing\nBut they take comfort in just knowing\nThat they are special and apart\nThe lovers, the lovers of the heart... the lovers\nAnd when love comes again\nAnd when love comes\nHello...\nRises from their throats like singing\nCatches in their hearts like wind\nThe good things\nStrangers in their arms are bringing\nMakes life all right again\nThey turn their faces to the light\nNo longer hiding in the night\nSo unashamed and unafraid\nThat they can face each others faults\nAnd though the waltz will have its ending\nThere is no harm in just pretending\nThat they are special and apart\nThe lovers, the lovers of the heart... the lovers", 
    "title": "The Lovers"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-ultracheese-lyrics", 
    "id": 3629323, 
    "lyrics": "Still got pictures of friends on the wall\nI suppose we aren't really friends anymore\nMaybe I shouldn't ever have called that thing friendly at all\nGet freaked out from a knock at the door\nWhen I haven't been expecting one\nAnd didn't that used to be part of the fun, once upon a time?\nWe'll be there at the back of the bar\nIn a booth like we usually were\nEvery time there was a rocket launch or some big event\n\nWhat a death I died writing that song\nStart to finish, with you looking on\nIt stays between us, Steinway, and his sons\n'Cause it's the ultracheese\nPerhaps it's time that you went for a walk\nDressed like a fictional character\nFrom a place they called America in the golden age\nTrust the politics to come along\nWhen you were just tryna orbit the sun\nWhen you were just about to be kind to someone\nBecause you had the chance\n\nI've still got pictures of friends on the wall\nI might look as if I'm deep in thought\nBut the truth is I'm probably not\nIf I ever was\n\nOh, the dawn won't stop weighing a tonne\nI've done some things that I shouldn't have done\nBut I haven't stopped loving you once", 
    "title": "The Ultracheese"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-view-from-the-afternoon-lyrics", 
    "id": 82415, 
    "lyrics": "Anticipation has the habit to set you up\nFor disappointment in evening entertainment, but\nTonight there'll be some love, tonight there'll be a ruckus\nYeah, regardless of what's gone before\nI want to see all of the things that we've already seen\nThe lairy girls hung out the window of the limousine\nOf course it's fancy dress\nAnd they're all looking quite full on in bunny ears and devil horns and how\n\nAnticipation has the habit to set you up\nFor disappointment in evening entertainment, but\nTonight there'll be some love, tonight there'll be a rawkus\nYeah, regardless of what's gone before\nI want to see all of the things that we've already seen\nI wanna see you take the jackpot out the fruit machine\nAnd put it all back in\nYou've got to understand that you can never beat the bandit, no\n\nAnd she won't be surprised and she won't be shocked\nWhen she's pressed the star after she's pressed unlock\nAnd there's verse and chapter sat in her inbox\nAnd all that it says is that you've drank a lot\nAnd you should bear that in mind tonight\nBear that in mind\nYeah, you should bear that in mind tonight\nBear that in mind\n\nAnd you can pour your heart out but her reasoning will block\nOwt you send her after nine o' clock\n\nAnticipation has the habit to set you up\nFor disappointment in evening entertainment, but\nTonight there'll be some love, oh, tonight there'll be a rawkus Yeah, regardless of what's gone before\n\nAnd she won't be surprised and she won't be shocked\nWhen she's pressed the star after she's pressed unlock\nAnd there's verse and chapter sat in her inbox\nAnd all that it says is that you've drank a lot\nAnd you should bear that in mind tonight\nBear that in mind\nYeah, you should bear that in mind tonight\nBear that in mind\n\nAnd you can pour your heart out around three o' clock\nWhen the two-for-one's undone the writer's block", 
    "title": "The View from the Afternoon"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-the-worlds-first-ever-monster-truck-front-flip-lyrics", 
    "id": 3629329, 
    "lyrics": "You push the button and we’ll do the rest\nThe exotic sound of data storage\nNothing like it, first thing in the morning\nYou push the button and we’ll do the rest\nBastard Latin, that’s the best thing for it\nYou push the button and we’ll do the rest\n\nYou and Lizzy in the summertime\nWrapping my tiny mind around a lullaby\n\nThere are things that I just cannot explain to you\nAnd those that I hope I don’t ever have to\n\nPattern language, in the mood for love\nYou push the button and we’ll do the rest\n\nYou and Genie wearing Stetson hats\nTrying to gain access to my lily pad\n\nThere are things that I just cannot explain to you\nAnd those that I hope I don’t ever have to\n\nThe world’s first ever monster truck front flip\nI’m just a bad girl trying to be good\nI’ve got a laser guiding my love that I cannot adjust\n\nForward thinking model villages\nMore brain shrinking moving images\nYou push the button and we’ll do the rest", 
    "title": "The World's First Ever Monster Truck Front Flip"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-this-house-is-a-circus-lyrics", 
    "id": 93908, 
    "lyrics": "This house is a circus, berserk as fuck\nWe tend to see that as a perk, though\nLook what it's done to your friends\nTheir memories are pretend\nAnd the last thing that they want is for the feeling to end\nThis house is a circus, berserk as fuck\nWe tend to see that as a perk, though\nLook what it's done to your friends\nTheir memories are pretend\nAnd the last thing that they want is for the feeling to end\n\nThere's a room full of trouble and there's lovers to be had\nThose ones who make sinners out of such lovely lads\nScaling the corridors for maidens in the maze\nAnd the anomaly is slipping into familiar ways\nAnd we're forever unfulfilled and can't think why\nLike a search for murder clues in dead man's eyes\nForever unfulfilled and can't think why\nLike a search for murder clues in dead man's eyes\n\nThe more you open your mouth, the more you're forcing performance\nAnd all the attention is leading me to feel important\n(Maybe I'm not just completely obnoxious)\nNow that we're here, we may as well go too far\n\nWriggling around in incidents you won't forget\nThere's certainly some venom in the looks that you collect\nAimlessly gazing at the faces in the queue\nAnd we're struggling with the notion that it's life, not film\n\nThis house is a circus, berserk as fuck (We're forever unfulfilled)\nWe tend to see that as a perk, though (Can't think why)\nLook what it's done to your friends\nTheir memories are pretend (Like a search for murder clues)\nAnd the last thing that they want is for the feeling to end", 
    "title": "This House Is a Circus"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-too-much-to-ask-lyrics", 
    "id": 129764, 
    "lyrics": "The smiles as she walked in the room\nHave all turned into frowns\nAm I too quick to assume that the love is no longer in bloom?\nThe tantrums and the tears play a very different tune\nTo what they did before, her head's red raw\nAnd the ending doesn't sound like the happiest around\nWhen you sobbed before\nIt felt much more like the product of a squabble\nNow there's reason for it to be something more\n\nAnd there would be, oh, it's uncertain\nWhether the curtain has shut for good\nShe said, \"See if it's still raining, I'm not dressed for it\"\nAnd, \"If you loved me–\"\nAnd I interrupt and received the scowl and stare\nBut still decided to stop her there\n\nWould it be outrageous to say\nWe're either shouting or we're shagging?\nDocked in tempestuous bays\nAt least that's how it felt yesterday\nThe eyes are getting heavier\nAnd whether you're asleep or awake\n\nIs a mystery\nWould a kiss be too much to ask?\nWhen you fit me\nAs Sunday's frozen pitch fits the thermos flask\nIt's a pity, it just hit me, we can't go back\nTo the chest touching on the back", 
    "title": "Too Much to Ask"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-tranquility-base-hotel-and-casino-lyrics", 
    "id": 3629326, 
    "lyrics": "Jesus in the day spa, filling out the information form\nMama got her hair done, just popping out to sing a protest song\nI've been on a bender back to that prophetic esplanade\nWhere I ponder all the questions but just manage to miss the mark\n\nGood afternoon\nTranquility Base Hotel and Casino\nMark speaking\nPlease, tell me, how may I direct your call?\n\nThis magical thinking feels as if it really might catch on\nMama wants some answers\nDo you remember where it all went wrong?\nTechnological advances really bloody get me in the mood\nPull me in close on a crisp eve, baby\nKiss me underneath the moon's side boob\n\nGood afternoon\nTranquility Base Hotel and Casino\nMark speaking\nPlease, tell me, how may I direct your call?\n\nAnd do you celebrate your dark side\nThen wish you'd never left the house?\nHave you ever spent a generation trying to figure that one out?\n\nGood afternoon\nTranquility Base Hotel and Casino\nMark speaking\nPlease, tell me, how may I direct your call?", 
    "title": "Tranquility Base Hotel & Casino"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-wagon-on-the-way-to-the-stripey-tent-lyrics", 
    "id": 3577021, 
    "lyrics": "( Instrumental version of Sandtrap.)", 
    "title": "Wagon On The Way To The Stripey Tent"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-wavin-bye-to-the-train-or-the-bus-lyrics", 
    "id": 287962, 
    "lyrics": "Oh baby, I'm wanting to do you a swap\nI'll give you anything, yeah\nIn return for the noises you've got\nAnd I can see you want to be attended to\nJust count to twenty-nine and I'll attend to you\nOh for sure... well certainly, yeah yeah yeah\nWavin' bye to the train or the bus\nI'm ever so worried because...\nI don't want to get all forgotten...\nSo very comfortable..\nDon't really need to put up my feet\nAnd even in fat sam's grand slam\nCan't see it being easier to speak\nWhen you've karate-kicked your way to someone new\nAnd I'm a memory and don't know what to do\nAll on his own...\nCollecting his dole n' stuff\nWavin' bye to the train or the bus\nI'm ever so worried because...\nI don't want to get all forgotten...\nCause we know\nYeah, we know-oh-oh-oh\nOh we know, a woah-oh-oh\nDon't know where we're going, baby\nI s'pose it depends\nBut even if we're all far apart\nWe can all come back and all be fine\nWe'll be able to be together again\nBe together again\nBe together again\nBe together again\nBe together again\nBe together again\nBe together again\nEverybody will be together again!", 
    "title": "Wavin' Bye to the Train or the Bus"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-whatever-people-say-i-am-thats-what-im-not-album-art-annotated", 
    "id": 483119, 
    "lyrics": "", 
    "title": "Whatever People Say I Am, That's What I'm Not Album Art"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-what-if-you-were-right-the-first-time-lyrics", 
    "id": 134305, 
    "lyrics": "Betwixt and between, the fantastic dream and the fear\nDo you wonder where she is this afternoon?\nAnd does it get on your nerves, make you slightly perturbed\nThat there's things that you don't know about her?\nAnd even the places that she's never been with you\nSeem awful empty without her\n\nYou can't look into those eyes\nDown no telephone line\nWhat if you were right first time?\nYou can't look into those eyes\nDown no telephone line\nWhat if you were right first time?\n\n\nBetwixt and between, the fantastic dream and the fear\nDo you wonder where she is this afternoon?\nAnd with the needle in groove, is there owt to prove?\nAnd tell me, are your feet still tapping?\nI know there’s a first for a trip over the water\nWhat is the worst that could happen?\n\nYou can't look into those eyes\nDown no telephone line\nWhat if you were right first time?", 
    "title": "What If You Were Right The First Time?"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-when-the-sun-goes-down-lyrics", 
    "id": 75362, 
    "lyrics": "I said, who's that girl there?\nI wonder what went wrong so that she had to roam the streets\nShe dunt do major credit cards, I doubt she does receipts\nIt's all not quite legitimate\nAnd what a scummy man\nJust give him half a chance, I bet he'll rob you if he can\nCan see it in his eyes, yeah, that he's got a driving ban\nAmongst some other offences\nAnd I've seen him with girls of the night\nAnd he told Roxanne to put on her red light\nThey're all infected but he'll be alright\n'Cause he's a scumbag, don't you know?\nI said, he's a scumbag, don't you know?\n\n\nAlthough you're trying not to listen\nAvert your eyes and staring at the ground\nShe makes a subtle proposition\n\"I'm sorry, love, I'll have to turn you down\"\nAnd oh, he must be up to summat\nWhat are the chances? Sure it's more than likely\nI've got a feeling in my stomach\nAnd start to wonder what his story might be\nWhat his story might be, yeah\n\n'Cause they said it changes when the sun goes down\nYeah, they said it changes when the sun goes down\nAnd they said it changes when the sun goes down\nAround here, around here\n\nLook, here comes a Ford Mondeo\nIsn't he Mr. Inconspicuous?\nAnd he don't even have to say owt\nShe's in the stance ready to get picked up\nBet she's delighted when she sees him\nPulling in and giving her the eye\nBecause she must be fucking freezing\nScantily-clad beneath the clear night sky\nIt don't stop in the winter, no\n\nAnd they said it changes when the sun goes down\nYeah, they said it changes when the sun goes down\nAnd they said it changes when the sun goes down\nAround here\nWell, they said it changes when the sun goes down\nOver the river, going out of town\nAnd they said it changes when the sun goes down\nAround here, around here, oh\n\nAnd what a scummy man\nJust give him half a chance, I bet he'll rob you if he can\nCan see it in his eyes, yeah, that he's got a nasty plan\nI hope you're not involved at all", 
    "title": "When the Sun Goes Down"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-who-the-fuck-are-arctic-monkeys-lyrics", 
    "id": 77655, 
    "lyrics": "We all want someone to shout for\nYeah, everyone wants somebody to adore\nBut your heroes aren't what they seem\nWhen you've been where we've been\nHave I done something to trigger\nThe funny looks and the sniggers?\nAre they there at all\nOr is it just paranoia?\n\n'Cause everybody's got their box, doing what they're told\nYou push my faith near being lost but we'll stick to the guns\nDon't care if it's marketing suicide, we won't crack or compromise\nYour derisory divides will never unhinge us\n\nAnd there's a couple of hundred\nThink they're Christopher Columbus\nBut the settlers had already settled\nHere long before you\nJust cos we're having a say so\nNot lining up to be Play-Doh\nOh, in five years time will it be\n\"Who the fuck's Arctic Monkeys?\"\n\n'Cause everybody's got their box, doing what they're told\nYou push my faith near being lost but we'll stick to the guns\nDon't care if it's marketing suicide, we won't crack or compromise\nYour derisory divides will never unhinge us\n\nAll the thoughts that I just said\nLinger round and multiply in the head\nNot that bad to start with\nI'm not angry, I'm just disappointed\n\nIt's not you, it's them that are wrong\nTell 'em to take out their tongues\nTell 'em to take out their tongues\nIt's not you, it's them that are wrong\nTell 'em to take out their tongues\nTell 'em to take out their tongues\nAnd bring on the backlash\n\nIt's not you, it's them that are wrong\nTell him to take out his tongue\nTell him to take out his tongue\nIt's not you, it's them that's the fake\nI won't mess with your escape\nIs this really your escape? Yeah", 
    "title": "Who the Fuck Are Arctic Monkeys?"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-whyd-you-only-call-me-when-youre-high-lyrics", 
    "id": 197412, 
    "lyrics": "The mirror's image tells me it's home time\nBut I'm not finished, 'cause you're not by my side\nAnd as I arrived I thought I saw you leavin'\nCarryin' your shoes\nDecided that once again I was just dreamin'\nOf bumpin' into you\n\nNow, it's three in the mornin'\nAnd I'm tryna' change your mind\nLeft you multiple missed calls\nAnd to my message, you reply\n\"Why'd you only call me when you're high?\"\n\"Hi, why'd you only call me when you're high?\"\n\nSomewhere darker, talkin' the same shite\nI need a partner, well are you out tonight?\nIt's harder and harder to get you to listen\nMore I get through the gears\nIncapable of makin' alright decisions\nAnd having bad ideas\n\nNow, it's three in the mornin'\nAnd I'm tryna' change your mind\nLeft you multiple missed calls\nAnd to my message, you reply (Message, you reply)\n\"Why'd you only call me when you're high?\"\n(Why'd you only call me when you're)\n\"Hi, why'd you only call me when you're high?\"\n\nAn' I can't see you here, wonderin' where I might\nIt sort of feels like I'm runnin' out of time\nI haven't found all I was hopin' to find\nYou said you got to be up in the mornin'\nGoin' to have an early night\nAn' you're startin' to bore me, baby\n\"Why'd you only call me when you're high?\"\n\n\"Why'd you only ever phone me when you're high?\"\n\"Why'd you only ever phone me when you're high?\"\n\"Why'd you only ever phone me when you're high?\"\n\"Why'd you only ever phone me when you're (high)?\"", 
    "title": "Why’d You Only Call Me When You’re High?"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-you-and-i-lyrics", 
    "id": 191905, 
    "lyrics": "I like the way you look at me, baby\nPlease don't try to turn out the lights\nI act as if I'm not going crazy\nBut girl, I'm in a muddle tonight\nWould you tell me where you're gonna take it?\nIf I had a heart, you're the one who should break it\nThe engine's running\nCan't decide if I should ride away\n\nYou and I\nYou and I\n\nI had a woman, she went away\nAnd now I'm lonely\nFuck it\n\nYou and I\nYou and I\nYou and I\nYou and I\n\n\nWould you tell me where you're gonna take it?\nIf I had a heart, you're the one who should break it\nThe engine's running\nCan't decide if I should ride away\n\nYou and I\nYou and I\nYou and I\nYou and I\nYou and I\nYou and I\n\nI like the way you look at me, baby\nPlease don't try to turn out the lights\nI act as if I'm not going crazy\nBut girl, I'm in a muddle tonight", 
    "title": "You and I"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-you-know-im-no-good-lyrics", 
    "id": 1488143, 
    "lyrics": "Meet you downstairs in the bar and heard\nYour rolled up sleeves and your skull t-shirt\nYou say why did you do it with him today?\nAnd sniff me out like I was tanqueray\nCause you're my fella, my guy\nHand me your stella and fly\nBy the time I'm out the door\nYou tear me down like Roger Moore\n\nI cheated myself\nLike I knew I would\nI told ya, I was troubled\nYou know that I'm no good\nUpstairs in bed, with my ex boy\nHe's in the place, but I can't get joy\nThinking of you in the final throws\nThis is when my buzzer goes\nRun out to meet your chicks and bitter\nYou say when we're married cause you're not bitter\nThere'll be none of him no more\nI cried for you on the kitchen floor\n\nI cheated myself\nLike I knew I would\nI told ya, I was troubled\nYou know that I'm no good\nSweet reunion, Jamaica and Spain\nWe're like how we were again\nI'm in the tub you're on the seat\nLick your lips as I soak my feet\nThen you notice lickle carpet burn\nMy stomach drops and my guts churn\nYou shrug and it's the worst\nTo truly stuck the knife in first\n\nI cheated myself\nLike I knew I would\nI told ya, I was troubled\nYou know that I'm no good", 
    "title": "You Know I'm No Good"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-you-probably-couldnt-see-for-the-lights-but-you-were-staring-straight-at-me-lyrics", 
    "id": 87454, 
    "lyrics": "One look sends it coursing through the veins\nOh, how the feeling races\nBack up to their brains to form expressions on their stupid faces\nThey don't want to say hello like I want to say hello\nWell, the heartbeat's at its peak when you're coming up to speak\nAnd oh, I'm so tense, never tenser, could all go a bit Frank Spencer\nAnd I'm talking gibberish, tip of the tongue but I can't deliver it\nProperly, oh, it's all getting on top of me\nAnd if it weren't this dark, you'd see how red my face has gone Yeah\n\nEverybody's trying to crack the jokes and that to make you smile\nThose that claim that they're not showing off\nAre drowning in denial\nBut they're not half as bad as me, say anything and I'll agree\n'Cause when it comes to acting up, I'm sure I could write the book\nAnd now that you're more than a part in the play\nIt's slightly easier to think what to say\nYou had us all, standing on our heads, doing our best tricks, yeah\n\nNever again, well, never again, no\nWill there be another one quite as desirable as you\nOne look sends it coursing through the veins\nOh, how the feeling races\nBack up to their brains to form expressions on their stupid faces", 
    "title": "You Probably Couldn't See for the Lights But You Were Staring Straight at Me"
  }, 
  {
    "url": "https://genius.com/Arctic-monkeys-youre-so-dark-lyrics", 
    "id": 288898, 
    "lyrics": "You got your H.P. Lovecraft\nYour Edgar Allan Poe\nYou got your unkind of ravens\nAnd your murder of crows\nCatty eyelashes\nAnd your Dracula cape\nBeen flashing triple-A passes\nAt the cemetery gates\n\n'Cause you're so dark, babe\nBut I want you hard\nYou're so dark, baby\n\nYou're so dark\nYou're so dark\nYou're so dark\nYou're so dark\n\nAnd you're so mysterious\nGot that obsession with death\nI saw you driving your Prius\nAnd even that was Munster Koach-esque\nYou watch Italian horror\nAnd you listen to the scores\nLeather-cladded, spike collared\nI want you down on all fours\n\n'Cause you're so dark, babe\nBut I want you hard\nYou're so dark, baby\n\nI know you're nothing like mine\n'Cause she's walking on sunshine\nAnd your love would tear us apart\nAnd I know I'm not your type\n'Cause I don't shun the daylight\nBut, baby, I'm willing to start\n\nYou're so dark\n\nGot your H.P. Lovecraft\nYour Edgar Allen Poe\nGot your unkind of ravens\nGot your murder of crows\n\nYou're so dark, babe\nBut I want you hard\nYou're so dark, baby\nBut I want you hard\nYou're so dark, oh\nBut I want you hard\nYou're so dark, baby", 
    "title": "You're So Dark"
  }
]